CREATE TABLE [towns] (
  [id] INT,
  [cityid] INT,
  [city] TEXT,
  [town] TEXT,
  [note] TEXT
);

INSERT INTO "towns" VALUES (9007010, 9007, '連江縣', '南竿鄉', '南竿島昔稱「上竿塘」，與北竿島合稱「上下竿塘」、「竿塘山」。在北宋中期，福建長樂、連江等縣沿海居民，已涉海移居南北竿，以農、漁為業。南宋梁克家的《三山志》中曾記述到：「上下竿塘、大小亭山、桑崳、關嶺、蛤沙、北茭鎮，俱在現東北海中」，係最早的書面文獻。');
INSERT INTO "towns" VALUES (9007020, 9007, '連江縣', '北竿鄉', '北竿鄉位於馬祖列島中北部，座落於福建閩江口外，昔日史書上，與南竿島分別稱作下竿塘、上竿塘或北竿塘、南竿塘，合稱竿塘。過去也有官塘、吳潼等名稱。');
INSERT INTO "towns" VALUES (9007030, 9007, '連江縣', '莒光鄉', '原稱東沙鄉、白犬鄉，位於馬祖列島南部，原屬長樂縣，現屬中華民國福建省連江縣的一鄉。由東莒島、西莒島兩島所組成。1971年國軍接管更名為莒光鄉，寓意「毋忘在莒」，東犬島、西犬島因此更名為東莒島、西莒島。莒光舊名白犬、白肯（「肯」為福州話「犬」之擬音），因其二島山形如二狗，東島稱東犬島，西島稱西犬島，合稱「白犬列島」。當地住民常以「東島」、「西島」稱東莒、西莒。');
INSERT INTO "towns" VALUES (9007040, 9007, '連江縣', '東引鄉', '「東引」原名「東湧」，據民間傳說，很早以前，福州東北方海面，一夜之間湧現一座小島，無以為名，遂名之「東湧島」。其實，在馬祖列島中，東引海域最深，船帆從南竿駛向東引，過了亮島（俗稱浪島），湧浪便轉大，因此，古人才以「湧」來稱呼。東引「水深潮暢、群礁拱抱」，是保育鳥類黑尾鷗的故鄉。');
INSERT INTO "towns" VALUES (9020010, 9020, '金門縣', '金城鎮', '1915年金門縣設縣，金城地區隸屬第一都，1935年試行地方自治時改第一區，1945年改珠浦鎮，1946年與古湖鄉合併為珠美鎮，1949年古寧頭戰役後設立「城廂區公所」，隸屬金門第二民政處，管轄東門、西門、南門、北門四個里，1950年5月金門行政公署成立，1953年2月恢復縣制後實施地方自治，選舉鎮長，改稱為金城鎮，1965年九月併編金山鄉（除東洲併入金寧鄉外）餘金水、古城、珠沙、垵湖、賢庵等五個行政村，包括原轄東門、南門、西門、北門四個里，計九個行政村里。1975年二月精簡所轄村里，將垵湖村裁撤，其原轄後湖、上下後垵併入金寧鄉榜林村，泗湖併入珠沙村，縮編為現有的東門、西門、南門、北門、賢庵、金水、古城、珠沙八個里。1992年11月，終止戰地政務，鄉鎮公所組織規程，依地方自治綱要第卅四條規定訂定之。');
INSERT INTO "towns" VALUES (9020020, 9020, '金門縣', '金沙鎮', '位居金門島之東北部，由於地處東北季風迎風面，風害狂烈，因此用以防風定砂的風獅爺特別多。地形略呈三角形，南與金湖鎮相鄰。');
INSERT INTO "towns" VALUES (9020030, 9020, '金門縣', '金湖鎮', '位於金門本島東南部；北界金沙鎮，西接金寧鄉，東、南兩面及西北角一隅臨海。鎮內有料羅港、金門機場等交通建設，太武山、太湖等風景勝地，及瓊林戰鬥坑道、擎天廳、八二三戰史館等軍事紀念建築。金湖鎮原名滄湖鎮，民國四十三年七月一日當局為適應實際需要改為金湖鄉，設址湖前，轄八個行政村，民國四十六年十二月改為金湖鎮，民國四十八年成立金瓊鄉，正義，瓊林兩村撥歸該鄉，復於民國五十四年九月十六日金瓊鄉裁併，正義，瓊林又棣屬金湖鎮，但新前墩，東沙尾併屬金沙鎮。');
INSERT INTO "towns" VALUES (9020040, 9020, '金門縣', '金寧鄉', '位於金門島西北隅，三面環海，東與金湖鎮相鄰，西南方連接金城鎮，總面積為29.8540平方公里。1949年古寧頭戰役後，成立古寧、金盤兩區公所，隸屬金門民政處；1951年，兩區公所合併，更名為金寧區公所，隸屬金門軍管區行政公署，1953年將古寧、安美、湖埔、榜林、盤山、後盤等六個行政區合併為金寧鄉，為金門島上唯一的鄉。');
INSERT INTO "towns" VALUES (9020050, 9020, '金門縣', '烈嶼鄉', '位於金門本島西南西方，居於金廈兩門之間，位處於福建省東南隅的九龍江口外、廈門灣內，並包括大膽島、二膽島、三膽島、四膽島、五膽島、復興嶼、猛虎嶼、獅嶼、檳榔嶼等諸小島。屬中華民國金門縣管轄。烈嶼島距離中國大陸廈門島大約5公里，在戰略位置上是「外島中的外島，前線中的前線」。');
INSERT INTO "towns" VALUES (9020060, 9020, '金門縣', '烏坵鄉', '原屬福建省莆田縣[1]，1954年起改由金門縣代管[2]，面積約1.2平方公里，人口僅600多人，是中華民國面積最小、人口最少的鄉，也是中華民國面積第二小的鄉鎮市區[註 2]，地形為大陸島，由大坵嶼和小坵嶼組成，行政區劃分為二個村。

烏坵鄉是中華民國政府在臺灣地區管轄時間最久的領土，僅於閩變期間中華共和國政權成立後暫時失去管治，屬興泉省（初稱泉海省），歷時53天，而後從未被共軍占領。後雖為金門縣所代管，但距離金門本島甚遠，兩地並無經常性交通工具，日常補給與交通必須仰賴15天一班往返臺中港的民用交通船金門快輪。由於交通皆極為不便，素有「離島中的離島」之稱。現由中華民國海軍陸戰隊烏坵守備大隊防守。');
INSERT INTO "towns" VALUES (10002010, 10002, '宜蘭縣', '宜蘭市', '宜蘭舊稱『噶瑪蘭』或是『蛤仔難』，這些名稱都是翻譯自原來居住於宜蘭平原上的平埔族噶瑪蘭族的族名，後來到了清光緒元年，在此設縣，縣名即是在原來的『蘭』字上，加上『宜』這個文雅的字，成為宜蘭縣，而一直沿用至今。');
INSERT INTO "towns" VALUES (10002020, 10002, '宜蘭縣', '羅東鎮', '『羅東』這個地名是出自於平埔族的譯音，由於相傳此地境內的路上有一塊形狀類似彌猴的大石頭，而平埔族人稱猴子的語音就類似『羅東』兩個字，所以就命名此地為『羅東』。');
INSERT INTO "towns" VALUES (10002030, 10002, '宜蘭縣', '蘇澳鎮', '傳說在清嘉慶年間，有一個名為蘇士尾的人，首先率領壯丁來此地開墾，因此就以其姓『蘇』字，再配以這邊的地形，是屬於一個位於水邊彎曲之地的『澳』字，命名此地為『蘇澳』。');
INSERT INTO "towns" VALUES (10002040, 10002, '宜蘭縣', '頭城鎮', '在清嘉慶年間，首先入墾蘭陽平原的吳沙，最先在此地建築土城來防禦番人，因此就取名為『頭城』。');
INSERT INTO "towns" VALUES (10002050, 10002, '宜蘭縣', '礁溪鄉', '礁溪的『礁』字，台語的意思為『乾』的意思，這是因為這附近的溪谷中，通常都是水量稀少，有時甚至呈現乾涸的狀態，所以就稱此地為『礁溪』。');
INSERT INTO "towns" VALUES (10002060, 10002, '宜蘭縣', '壯圍鄉', '當年吳沙率領壯丁來宜蘭開墾，吳沙死後，他的兒子繼承父志，來此地拓墾，在開墾完成之後，其子為了酬謝壯丁門幫助開墾的辛勞，就將此地劃分為壯一、壯二......壯七等，賞給壯丁，後來統稱此地為『壯圍』，成為今天的地名。');
INSERT INTO "towns" VALUES (10002070, 10002, '宜蘭縣', '員山鄉', '由於此地的東邊有一座孤立的圓形山丘，所以就稱此地為『員山』。');
INSERT INTO "towns" VALUES (10002080, 10002, '宜蘭縣', '冬山鄉', '地名的由來有兩種說法，一種是說此地的南方有一座形狀類似冬瓜的山，所以稱為『冬山』；另一種是說，五結鄉利澤村的人利用冬山溪運送冬瓜來此地販賣，所以稱此地為『冬山』。');
INSERT INTO "towns" VALUES (10002090, 10002, '宜蘭縣', '五結鄉', '結』是指以前開墾時的一種結首制度，亦即當有一地方由許多人開墾完成後，會把墾地劃分次序，如一、二、三.....等幾份，再由開墾者用抽籤來分配。而此地在開墾之後，劃分為中一結、中二結、頂三結、.....下五結等聚落，因此後來就稱此地為『五結』。');
INSERT INTO "towns" VALUES (10002100, 10002, '宜蘭縣', '三星鄉', '因為此地靠近三星山，所以就以山名為地名，稱為『三星』。');
INSERT INTO "towns" VALUES (10002110, 10002, '宜蘭縣', '大同鄉',
'此地本來稱為太平鄉，是因為境內有太平山的緣故，後來改為『大同鄉』，則是取自三民主義世界大同的政治理想。');
INSERT INTO "towns" VALUES (10002120, 10002, '宜蘭縣', '南澳鄉', '由於此地本來是泰雅族之南澳社的居住地，所以稱此地為『南澳』。');
INSERT INTO "towns" VALUES (10004010, 10004, '新竹縣', '竹北市', '竹北原稱為『舊港』，這是由於本地原為鳳山溪的港口，後來由於此地位於新竹市之北方，所以改稱為『竹北』。');
INSERT INTO "towns" VALUES (10004020, 10004, '新竹縣', '竹東鎮', '竹東原稱為『樹杞林』，因往昔此地為樹杞茂密的森林地帶。後來由於此地位於新竹市之東方，故改稱為『竹東』。');
INSERT INTO "towns" VALUES (10004030, 10004, '新竹縣', '新埔鎮', '此地在清雍正年間，就有漢人入墾，因為移民大多從紅毛港、香山港登陸後，才來此地開墾，對於已經墾畢的沿海地帶而言，此地較晚開發，所以稱之為『新埔』。');
INSERT INTO "towns" VALUES (10004040, 10004, '新竹縣', '關西鎮', '關西舊稱為『咸菜硼』，這是因為本地多屬客籍移民，他們擅長醃製鹹菜，本地也盛產之，所以有『咸菜硼』之稱。民國九年時，由於『咸菜硼』的客語讀音與日語的『關西』音相近，所以改稱此地為『關西』。');
INSERT INTO "towns" VALUES (10004050, 10004, '新竹縣', '湖口鄉', '湖口舊稱『大湖口』，『湖』是指盆狀的窪地，由於附近一帶有一連串的窪地，而此地正位於這些窪地的出入口，故有此稱，後來簡稱為『湖口』。');
INSERT INTO "towns" VALUES (10004060, 10004, '新竹縣', '新豐鄉', '新豐舊稱『紅毛港』，傳說以前曾有荷蘭人的船停靠於此，故有此名。後來，政府認為『紅毛』為不雅之稱，所以改此地名為『新豐』。');
INSERT INTO "towns" VALUES (10004070, 10004, '新竹縣', '芎林鄉', '本地原稱為『九芎林』，這是由於當地以前是九芎樹茂生之地，故有此稱，後來簡稱為『芎林』。');
INSERT INTO "towns" VALUES (10004080, 10004, '新竹縣', '橫山鄉', '此地名源於境內有一座名為『大山背山』的山橫亙，所以稱此地為『橫山』。');
INSERT INTO "towns" VALUES (10004090, 10004, '新竹縣', '北埔鄉', '北埔是指北方的埔地，係與其南方的南埔對稱，都是屬於當時的未墾地。');
INSERT INTO "towns" VALUES (10004100, 10004, '新竹縣', '寶山鄉', '本地原稱為『草山』，這是因為本地初墾時，是雜草叢生的山丘，故有此稱。而民國九年時，以原『草山』之『山』及其境內另一處名為『寶斗仁』之『寶』二字拼成，改稱此地為『寶山』。');
INSERT INTO "towns" VALUES (10004110, 10004, '新竹縣', '峨眉鄉', '峨眉以前稱為『月眉』，這是因為此地恰位於峨眉溪曲流凸岸的半月形沖積河階上(滑走坡)，故有此稱，後來改以其近音『峨眉』稱之。');
INSERT INTO "towns" VALUES (10004120, 10004, '新竹縣', '尖石鄉', '由於本地境內有大壩尖山，故有此稱。另有一說是本鄉溪床中有一尖石突出，因而得名。');
INSERT INTO "towns" VALUES (10004130, 10004, '新竹縣', '五峰鄉', '由於境內有五指山五峰並峙，故命名為『五峰』。');
INSERT INTO "towns" VALUES (10005010, 10005, '苗栗縣', '苗栗市', '本市舊稱為『貓裡』，因早期此地為平埔族道卡斯族之『貓裡社』所居。『貓裡』是平原的意思。');
INSERT INTO "towns" VALUES (10005020, 10005, '苗栗縣', '苑裡鎮', '『苑裡』地名是由來於道卡斯族『苑裡社』的社名。');
INSERT INTO "towns" VALUES (10005030, 10005, '苗栗縣', '通霄鎮', '通霄原稱為『吞霄』，是道卡斯族的社名。日據時期時，以其當地的虎頭山平地突起，聳入雲霄，便改此地為『通霄』。');
INSERT INTO "towns" VALUES (10005040, 10005, '苗栗縣', '竹南鎮', '本地因為位於新竹之南，故有此稱。');
INSERT INTO "towns" VALUES (10005050, 10005, '苗栗縣', '頭份市', '本地在以前由一群人合夥開墾之後，他們將墾地劃分，並以頭、二、三、四、五......為代號，作為抽取分配之用，本地為『頭』份，故有此稱。');
INSERT INTO "towns" VALUES (10005060, 10005, '苗栗縣', '後龍鎮', '地名由來於聚落建立在後方有長條狀起伏的地方，故有『後龍』之稱。');
INSERT INTO "towns" VALUES (10005070, 10005, '苗栗縣', '卓蘭鎮', '鄉名出自於本地的巴宰海平埔族自稱此地地名之譯音『塔連』，意思為美麗的原野。後來改為『罩蘭』。民國九年更改為『卓蘭』而沿用至今。');
INSERT INTO "towns" VALUES (10005080, 10005, '苗栗縣', '大湖鄉', '因為本地的地形是一塊大的河谷盆地，故有『大湖』之稱，客家語『湖』有指盆地之意。');
INSERT INTO "towns" VALUES (10005090, 10005, '苗栗縣', '公館鄉', '鄉名由來於本地拓墾完成後，墾戶的首領設租館於此，此種處理墾務的租館，在當時稱之為『公館』，本地故有此稱。');
INSERT INTO "towns" VALUES (10005100, 10005, '苗栗縣', '銅鑼鄉', '銅鑼原名為『銅鑼灣』，因為聚落建造於三面環山的弧形山麓，地形類似銅鑼，故有此稱。');
INSERT INTO "towns" VALUES (10005110, 10005, '苗栗縣', '南庄鄉', '由於本地村落位於早期的墾成地『田尾公館』之南方，故稱為『南庄』。');
INSERT INTO "towns" VALUES (10005120, 10005, '苗栗縣', '頭屋鄉', '頭屋舊稱為『崁頭屋』，位於老田寮溪的河階上，因為老田寮溪的沿岸多河階，而本地位於第一個河階上，故有所稱。後來則改稱此地為『頭屋』。');
INSERT INTO "towns" VALUES (10005130, 10005, '苗栗縣', '三義鄉', '三義舊稱為三叉河，這是因為打哪叭溪、打木溪、大坑溪等三溪在此會流，故有此稱。光復之後，改此地為『三義』，其由來，可能是『義』字之簡寫與『叉』字相似，所以才改為『三義』。');
INSERT INTO "towns" VALUES (10005140, 10005, '苗栗縣', '西湖鄉', '西湖昔稱為『四湖』，因為本地附近有一連串的小河谷盆地，從下游而上，有頭湖、二湖、三湖、四湖、五湖至九湖，其中四湖即位於本鄉的中央，為了避免與雲林縣四湖鄉同名，乃將其改為『西湖』。');
INSERT INTO "towns" VALUES (10005150, 10005, '苗栗縣', '造橋鄉', '因為以前的移民曾在今造橋村之北端南港溪上游築橋，以方便通行，故稱此地為『造橋』。');
INSERT INTO "towns" VALUES (10005160, 10005, '苗栗縣', '三灣鄉', '因為本地恰位於中港溪中游東岸的第三個曲流河階上，故稱為『三灣』。');
INSERT INTO "towns" VALUES (10005170, 10005, '苗栗縣', '獅潭鄉', '因為本鄉東北方有獅頭山，故取其『獅』字，又境內老田寮溪之曲流地形頗為發達，凹岸深水處多『潭』，於是併此兩字『獅潭』為本鄉之地名。');
INSERT INTO "towns" VALUES (10005180, 10005, '苗栗縣', '泰安鄉', '以前此地舊稱為『大安』，乃因此地為大安溪之上源，後來因為與台中縣之大安鄉同名，故改為『泰安』鄉。');
INSERT INTO "towns" VALUES (10007010, 10007, '彰化縣', '彰化市', '彰化從前稱為「半線街」，是平埔族中巴布薩族半線社的所在地。雍正元年乃改稱彰化。「彰化」一稱之由來，據福建巡撫王紹蘭「彰化縣碑記」中的一段話：「實獲眾心、保域保民、彰聖天子、丕昌海隅之化歟」，可得知『彰化』就是顯彰皇化的意思。');
INSERT INTO "towns" VALUES (10007020, 10007, '彰化縣', '鹿港鎮', '原名「鹿仔港」，這地名的由來，有四種說法：
1.早期此地為鹿群聚集之處，因此命名為「鹿仔港」。
2.由當地原住民平埔族Rokau-an--語音譯轉化（閩南語發音）。
3.因港灣形狀似鹿角而得名。
4.昔為米糧集散地，而方形米倉稱為「鹿」，故得名。
據學者的研究推論，以第一種說法較為可信。（莊展鵬，民81，鹿港，遠流出版公司）。');
INSERT INTO "towns" VALUES (10007030, 10007, '彰化縣', '和美鎮', '和美原叫做「和美線」，民國九年改為和美。現在以詔安橋為界，以西為泉州移民的墾地，以東為來自彰化的漳州墾民的墾地，境內是兩州墾民接觸之地，因為有鑑於漳泉械鬥迭起，為勸誡械鬥，和睦美鄰，所以稱之為「和美」。');
INSERT INTO "towns" VALUES (10007040, 10007, '彰化縣', '線西鄉', '線西從前叫做「下見口」或「下徑口」，因為此地聚落在四股圳入海處，似乎可以看見河口，所以稱為「見口」。民國九年因其從前屬線西堡，於是以堡名為地名。');
INSERT INTO "towns" VALUES (10007050, 10007, '彰化縣', '伸港鄉', '伸港初作「新港」，因為是新闢的港口，所以得名。後來因為與嘉義縣新港鄉同名，所以於民國四十八年七月一日，更改為伸港鄉。');
INSERT INTO "towns" VALUES (10007060, 10007, '彰化縣', '福興鄉', '「福興」就是福建省移民在此，振興事業，建莊興隆的意思。');
INSERT INTO "towns" VALUES (10007070, 10007, '彰化縣', '秀水鄉', '秀水原叫作「臭水」，因為從前此地墾域是灌溉水的末端，排水不佳，積水發臭的緣故。後來改為「秀水」。');
INSERT INTO "towns" VALUES (10007080, 10007, '彰化縣', '花壇鄉', '花壇得名自現在花壇村之舊稱「茄苳腳」，因為從前這一帶是茄苳樹茂生之地，經當初移民的採伐，進而開墾成耕地，並建莊於此，所以以它為地名。');
INSERT INTO "towns" VALUES (10007090, 10007, '彰化縣', '芬園鄉', '芬園從前稱為「芬園新莊」，傳說是清代在此地種植煙草而得名。');
INSERT INTO "towns" VALUES (10007100, 10007, '彰化縣', '員林市', '康熙末年之後，移民入墾者激增，到雍正初年已形成村莊，漸漸發展成市街。因為墾民啟林闢地，留下圓形林地，創建聚落於此，所以稱為「員林仔」，後來刪掉「仔」，改為「員林」。（員林鎮志，民79，彰化縣員林鎮公所 編印）');
INSERT INTO "towns" VALUES (10007110, 10007, '彰化縣', '溪湖鎮', '溪湖從前叫做「湖厝」，位於彰化縣內略中央的位置，有舊濁水溪及麥嶼厝溪中段斜貫而過，支流環流於此，其周圍又有許多沙丘群，因為溪道環流，所以取其「溪」，盆狀低地稱「湖」，合併而成「溪湖。');
INSERT INTO "towns" VALUES (10007120, 10007, '彰化縣', '田中鎮', '田中鎮名取自清代的田中央莊。本地初期是一片水田，後來因為濁水溪氾濫而流失泰半，於是另外選擇他地，變水田為市街。「田中」的地名因此而得。');
INSERT INTO "towns" VALUES (10007130, 10007, '彰化縣', '大村鄉', '大村從前叫做「燕霧大莊」，意思是燕霧山（八卦台地）下的一大集村，因而稱大村。');
INSERT INTO "towns" VALUES (10007140, 10007, '彰化縣', '埔鹽鄉', '地名由來有二說：一說本地在過去移民建村時，為蒲鹽菁茂生之地，所以引用為地名。另一說是因為此地係鹽分頗高的荒埔地而得名。');
INSERT INTO "towns" VALUES (10007150, 10007, '彰化縣', '埔心鄉', '埔心過去叫做「大埔心」，因為此地位於廣闊未墾的埔地中央位置，所以得名。');
INSERT INTO "towns" VALUES (10007160, 10007, '彰化縣', '永靖鄉', '永靖此地名，傳說是知縣楊桂森所命名，因為這一帶是粵籍移民的地域，從乾隆末年起，屢次為閩粵械鬥所波及，為了勸誡械鬥，取永久安靖之義，所以命名為「永靖」。');
INSERT INTO "towns" VALUES (10007170, 10007, '彰化縣', '社頭鄉', '清乾隆年間移民舉族入墾，建莊在平埔族大五郡社的社頭之上，所以將莊名稱之為社頭。');
INSERT INTO "towns" VALUES (10007180, 10007, '彰化縣', '二水鄉', '從前此地的村莊形成於「二分水圳」與「八堡圳」之間，所以命名為「二八水」。民國九年將舊稱「二八水」改為「二水」。
根據傳說，有兩種說法：
1.源自八堡圳的「八」字形分水。理由是：清康熙五十八年（一七一九）及六十年（一九二一），施世榜和黃仕卿兩位先賢，分別在二水開鑿八堡圳（即施厝圳、今八堡一圳）和十五庄圳（今八堡二圳），渠道至二水鼻仔頭，以「八」字形分為一圳及二圳，蜿蜒流貫本鄉腹地，再流向彰化平原，由此得名。
2.根據彰化人雜誌廿三、廿四期第六頁二水地名的由來一文著者陳國典研究指出：二水之所以叫二八水，是由於下敘兩個原因，兩個理由形成的：其一為在明鄭時期（一六六一~一六八三），自林圯埔（今之南投縣竹山鎮）要到本地時，必須經過二條溪，一為清水溪，一為濁水溪，越過此清、濁二條溪水，稱為「過二幅（Pak）水」，二幅水與「二八水」台語音雷同，古早先民移入本地時識字者不多，所以就將本地地名寫做「二八水」了。');
INSERT INTO "towns" VALUES (10007190, 10007, '彰化縣', '北斗鎮', '北斗舊稱為『寶斗』，是由於此地的街道整齊圖案，酷似寶斗仁，所以名之。後來改為近似音『北斗』，沿用至今。');
INSERT INTO "towns" VALUES (10007200, 10007, '彰化縣', '二林鎮', '鎮名由來是因為從前這一帶是平埔族巴布薩族二林社之所在地。');
INSERT INTO "towns" VALUES (10007210, 10007, '彰化縣', '田尾鄉', '田尾因為當時墾民創建村莊於十五圳的水田地帶末端，所以名之為「田尾」。');
INSERT INTO "towns" VALUES (10007220, 10007, '彰化縣', '埤頭鄉', '清雍正年間，漢人入墾於此，因為在莿仔埤圳頭建村，所以稱為『埤頭』。');
INSERT INTO "towns" VALUES (10007230, 10007, '彰化縣', '芳苑鄉', '本鄉原稱為「番仔挖」，因這一帶過去是平埔族巴布薩族的居住地，所以冠上「番仔」，且有一條溪道轉折入海於此，台語稱彎折為「挖」，合併而成地名。光復後改以當地舉人洪算諒的宅號「芳苑」為鄉名。');
INSERT INTO "towns" VALUES (10007240, 10007, '彰化縣', '大城鄉', '清道光初年時有移民墾殖於此，於是聚集成一大集村。因為械鬥頻繁，治安不良，於是築土成壘，以防禦盜匪，鄉名由此而得。');
INSERT INTO "towns" VALUES (10007250, 10007, '彰化縣', '竹塘鄉', '清初墾民遷入時，儲水為塘，以利灌溉，而且當時境內一帶有許多蘆竹茂生之水塘，所以稱此地為『竹塘』。');
INSERT INTO "towns" VALUES (10007260, 10007, '彰化縣', '溪州鄉', '『溪州』地名的由來，是由於本地為東螺溪與西螺溪之間的氾濫平原，所以稱之為『溪州』。');
INSERT INTO "towns" VALUES (10008010, 10008, '南投縣', '南投市', '南投之地名由來於洪雅平埔族（Hoahya）社名南投社。據諸羅縣志所載：「東為南投山，內社二，溪南（貓羅溪）為南投，溪北為北投」。由此可窺知漢人以其對北投譯音社名之位置關係而命名為南投社。（黃宗輝，民83，南投縣鄉土大系--南投史話篇，南投縣政府 編印）');
INSERT INTO "towns" VALUES (10008020, 10008, '南投縣', '埔里鎮', '由於從前眉溪邊有先住民聚落『埔裏社』，或單稱為『埔社』，所以得名。又泰雅族稱埔里為『薩巴哈、巴卡拉斯』，意思就是星星之屋，夜間由高山鳥瞰而下，漢人街屋，就有如天上星辰閃亮之故。');
INSERT INTO "towns" VALUES (10008030, 10008, '南投縣', '草屯鎮', '此地正好位於台中盆地的東緣山麓，為進入埔里中途要站，挑夫往返休息換草鞋的地方，其捨棄草鞋，堆積成墩，正是此地名的由來。');
INSERT INTO "towns" VALUES (10008040, 10008, '南投縣', '竹山鎮', '竹山舊稱為『林圯埔』，相傳林圯為鄭成功之參軍，在鄭經實施屯田制時，曾經率領部屬在此屯墾，墾成後乃命名此地為『林圯埔』。民國九年時，由於境內的山坡多為竹林之產地，乃改稱此地為『竹山』。');
INSERT INTO "towns" VALUES (10008050, 10008, '南投縣', '集集鎮', '地名由來有二說：
1.集集原稱為『半路店』，因早期店鋪街聚落恰位於西方「林尾」與東方「柴橋頭」中間，為聚集生活必需品以交易，故稱「集集」。
2.「集集」出自水沙連番Chipu chipu社之譯音漢字。(黃宗輝，民83，南投縣鄉土大系--南投史話篇，南投縣政府 編印）');
INSERT INTO "towns" VALUES (10008060, 10008, '南投縣', '名間鄉', '因為本地地勢低窪，四周雨水淤積於此，形成沼地，經年濕潤，土音呼曰「湳仔庄」，後將「湳仔」之土音，改呼日語讀音，民國九年，因閩南語讀音Lama與日語「名間」訓讀NA-ma近音，故以「名間」之漢字改稱之。(黃宗輝，民83，南投縣鄉土大系--南投史話篇，南投縣政府 編印）');
INSERT INTO "towns" VALUES (10008070, 10008, '南投縣', '鹿谷鄉', '鹿谷舊稱為『羌仔寮』，這是由於往昔本地未開闢時，附近有許多的羌群，民國九年時，有鑒於羌與鹿相似，而且境內又多溪谷地形，所以改稱此地為『鹿谷』。');
INSERT INTO "towns" VALUES (10008080, 10008, '南投縣', '中寮鄉', '由於早期從二重溪至哮貓間，墾民築寮成村，有六寮、十八甲寮、後寮、鄉親寮等，中寮正好居於其中，並與後寮對稱，所以得名。');
INSERT INTO "towns" VALUES (10008090, 10008, '南投縣', '魚池鄉', '魚池舊稱『魚池仔』。本鄉以前曾是一個湖泊，後因南港溪上源之侵蝕，導致湖水外溢而乾涸。但是原來湖底的深窪處，仍留下多處的殘跡湖，當墾民落居此地時，便就其地形特徵命名為『魚池』。');
INSERT INTO "towns" VALUES (10008100, 10008, '南投縣', '國姓鄉', '國姓以前亦稱為『內國勝』，民國九年以後稱『國姓』迄今。其地名之由來，相傳與延平郡王國姓爺的左武衛劉國軒，曾率兵追討大肚番抵此有關。');
INSERT INTO "towns" VALUES (10008110, 10008, '南投縣', '水里鄉', '水里原稱為『水裡坑』，『水裡坑』是從日月潭西岸之水裏社流至本鄉的一條河流，本地原屬於集集鎮，後來才劃分出，獨立成『水裡鄉』，後因其名不雅乃改稱『水里鄉』。');
INSERT INTO "towns" VALUES (10008120, 10008, '南投縣', '信義鄉', '本鄉居民以布農族為主，並有少數的曹族，光復後，取四維八德之雅句『信義』為鄉名。');
INSERT INTO "towns" VALUES (10008130, 10008, '南投縣', '仁愛鄉', '本鄉居民以泰雅族為主，並有少數布農族，以前此地並沒有命名，光復後，乃根據三民主義之政治理想，取四維八德之雅句，命名為仁愛鄉。');
INSERT INTO "towns" VALUES (10009010, 10009, '雲林縣', '斗六市', '斗六昔稱為『斗六門』，該地昔為平埔族洪雅族之斗六社的居住地，在康熙末年時，該地墾成，乃譯斗六社之音為地名，稱為『斗六門』。加上『門』字，乃是因為當時其位置恰位於諸羅縣東方之門鎖重鎮，因而有『斗六門』之稱。後來則去掉『門』字，改稱為『斗六』。');
INSERT INTO "towns" VALUES (10009020, 10009, '雲林縣', '斗南鎮', '斗南原稱『他里霧』，民國九年時，因其位於斗六之南方，故改稱為『斗南』。他里霧之地名是譯自當地的洪雅族之『他里霧社』社名。');
INSERT INTO "towns" VALUES (10009030, 10009, '雲林縣', '虎尾鎮', '虎尾舊稱為『五間厝』，最初開墾時名為「后尾」，後來因「后」與「虎」本地語音相似，日本人不知，鄉民也不明白，就將「后」誤為「虎」，於是「虎尾」地名就此沿用。（雲林縣政府編印。可愛的故鄉--雲林，頁6）');
INSERT INTO "towns" VALUES (10009040, 10009, '雲林縣', '西螺鎮', '『西螺』地名由來於當地的巴布薩平埔族之番社名『西螺社』。西螺（台語ㄙㄞ ㄌㄟ）最初是平埔族巴布薩族居住，他們稱本地為Soreau。三百多年前西螺地形很像田螺，而湊巧濁水溪對岸的北斗區也很像田螺，經協議將位於溪南端的叫西螺，北斗叫東螺。西螺又稱「螺陽」，一是依據「北辰南陽」的位置，就是濁水溪南畔；另一說是出自開拓者為追思故土福建螺陽而取。（西螺鎮公所編印。西螺鎮公所工作簡報）（雲林縣政府編印。可愛的故鄉--雲林，頁8）');
INSERT INTO "towns" VALUES (10009050, 10009, '雲林縣', '土庫鎮', '『土庫』昔作『塗庫』，其由來應與往昔當地的洪雅族之猴悶社自稱『土庫』之譯音有關，後來才改稱為『土庫』。');
INSERT INTO "towns" VALUES (10009060, 10009, '雲林縣', '北港鎮', '北港舊稱為『笨港』，由於往昔笨港被溪道截斷後成一北一南，將其在溪北者稱為『笨港北街』，後來則改稱為『北港街』，『北港』就成為本地的地名。');
INSERT INTO "towns" VALUES (10009070, 10009, '雲林縣', '古坑鄉', '古坑舊稱為『庵古坑』，可能是由來於初期的入墾者，在坑谷內種植菴瓜而有此稱，在民國九年時，改稱為『古坑』。另有一說為古時候有一對夫婦，專門打鐵為生，其所住的地方命名為「打鐵坑」，這一對夫婦非常恩愛，居民羨慕，乃稱此地為「尪婆仔坑」。日據時期因不文雅而更名「庵古坑」，其意為溫暖的古窩，行政區調整時改名「古坑鄉」。（雲林縣政府編印。可愛的故鄉--雲林，頁9）');
INSERT INTO "towns" VALUES (10009080, 10009, '雲林縣', '大埤鄉', '大埤原稱為『大埤頭』，其名稱由來有二說:
1.因往昔創村於荷包連圳埤之頭，故有此稱。荷包連圳即在早知與柳樹腳間，引倒孔溪之水，流向西北至大埤頭入圳，因在本地設埤塘儲水，乃稱之為大埤頭。
2.明末荷蘭人佔領時，於大埤西北方建設紅毛埤，其上游的庄社是在「紅毛埤」之頭頂，住民取其意稱為「大埤頭庄」。（雲林縣政府編印。可愛的故鄉--雲林，頁10）');
INSERT INTO "towns" VALUES (10009090, 10009, '雲林縣', '莿桐鄉', '莿桐原稱為『莿桐巷』，可能是由來於移民在莿桐樹林間，創建村莊，故得此稱。民國九年時，則改稱為『莿桐』。（雲林縣政府編印。可愛的故鄉--雲林，頁10）');
INSERT INTO "towns" VALUES (10009100, 10009, '雲林縣', '林內鄉', '此地清朝以前為濃密如蔭的大林野，後來閩人鄭萃徘自福建漳浦來此地開墾，在乾隆、嘉慶年間，因平匪有功而獲封賜，從此傳家立業，人口集結，因村莊在樹林內創建，故名「林內」。');
INSERT INTO "towns" VALUES (10009110, 10009, '雲林縣', '二崙鄉', '『二崙』即是在有兩座沙丘的地方創建村落而得名。二崙昔作『義崙』，這與本地的客籍移民有關，因為客語的『義』與『二』同音。後來此地便改稱為『二崙』。');
INSERT INTO "towns" VALUES (10009120, 10009, '雲林縣', '崙背鄉', '因為本地之村落創建於沙丘之背後（本鄉崙前村崙背國小舊址南邊）而得名。開拓先民為躲避暴風及洪水，便選擇地勢較高的沙丘偏南地帶定居，後來人口增加，便以此沙丘為界，稱沙丘南面地帶的部落為「崙前」，稱後移居的沙丘北面村莊為「崙背」，本鄉多偏屬沙丘之北，乃以「崙背」為名。（崙背鄉鄉公所編印，民83，崙背鄉之農業暨農地利用綜合規畫）（雲林縣政府編印。可愛的故鄉--雲林，頁12）');
INSERT INTO "towns" VALUES (10009130, 10009, '雲林縣', '麥寮鄉', '關於『麥寮』地名之起源，據傳墾殖初期有植麥者搭寮居住於此，故有此稱。');
INSERT INTO "towns" VALUES (10009140, 10009, '雲林縣', '東勢鄉', '清乾隆十三年間，有一黃姓家族遷來，不久人口增加成一大部落，民眾以東方之部分稱為「東勢厝」，之後設為「東勢鄉」。（雲林縣政府編印。可愛的故鄉--雲林，頁13）本鄉移民均由海豐港登陸，因處於海豐港之東方乃命名「東勢」，「勢」取人旺勢振之意，閩南語亦有方位之意。（雲林縣東勢鄉公所編印，雲林縣東勢鄉地方誌）');
INSERT INTO "towns" VALUES (10009150, 10009, '雲林縣', '褒忠鄉', '本地原稱為『埔姜崙』，乃是因為移民最初是在埔姜茂生之沙丘建庄，而有此稱，『崙』是沙丘的意思。後來在清乾隆五十一年時發生林爽文事件，當時本地一位名為張源懃的庠生，糾結了鄉勇數千人來抵抗，守莊數月，屢敗爽文軍，事後並且幫助官府平定其他地方的動亂。亂後，張生除了獲得清廷封官賞賜之外，其居住地亦獲賜『褒忠』二字為庄名，故原埔姜崙，從乾隆末業改稱『褒忠』。日據時期曾廢『褒忠』，而恢復原稱，光復後，乃再以『褒忠』為鄉名。');
INSERT INTO "towns" VALUES (10009160, 10009, '雲林縣', '臺西鄉', '臺西原稱為『海口厝』，因為地當舊虎尾溪之出海口，故有此稱。光復後，以其位於台灣島之西邊，改稱為『臺西』，以與臺北、臺南、臺東、臺中對稱。');
INSERT INTO "towns" VALUES (10009170, 10009, '雲林縣', '元長鄉', '本地在清乾隆六年時，有一位名為傅元掌的人，從福建省泉州府率人來此開墾，墾畢，創建村莊，並熱誠為地方服務，去世後鄉民為感念其恩德，乃以其名『元掌』為莊名。後來稱為『元長』之說有二，一為訛傳所致。另一說為清嘉慶年間，住民平亂有功，報請清廷嘉許，因「掌」與「長」諧音，賜改稱「元長」。（雲林縣政府編印。可愛的故鄉--雲林，頁11）');
INSERT INTO "towns" VALUES (10009180, 10009, '雲林縣', '四湖鄉', '『四湖』地名之由來，乃是由於往昔之聚落沿著境內的四個池沼而建立。該池沼係往昔潟湖陸化後之遺跡，已經萎縮成淡水的池塘。');
INSERT INTO "towns" VALUES (10009190, 10009, '雲林縣', '口湖鄉', '本地原名「烏麻園」，乃因往昔此地所種盡是烏麻。後來改稱口湖有二說：
1.光復後由於本地四周均有魚池，且廣闊如湖，故稱「口湖」。
2.由於本地地當四湖、後湖、內湖、施厝湖等以『湖』為地名之聚落群的入口位置，因而有『口湖』之稱。（雲林縣政府編印。可愛的故鄉--雲林，頁11）');
INSERT INTO "towns" VALUES (10009200, 10009, '雲林縣', '水林鄉', '水林原稱為『水燦林』，民國九年才改為今稱。該地昔為一大潟湖，陸化後多沼澤，因沼澤內水漆茂生，故有此稱。水漆生長於海泥中，葉有粗毛，觸之腫痛，與咬人狗同。');
INSERT INTO "towns" VALUES (10010010, 10010, '嘉義縣', '太保市', '本地舊稱為『溝尾庄』，是王得祿的故鄉，王得祿曾經平定了林爽文之亂，收復諸羅，後來也平定了蔡牽之亂，而被詔認為浙江提督。在其病老還鄉之後，清廷加封為『太子太保』之銜，當地的人便將原溝尾庄改稱為太保庄，『太保』就成為本地的地名。');
INSERT INTO "towns" VALUES (10010020, 10010, '嘉義縣', '朴子市', '朴子舊稱為『朴子腳』，由來於當時的聚落是創建在朴子樹之下，故有此稱，後來則改稱為『朴子』。其由來如下：『康熙廿六年（一六七八）半月庄林馬，自鹿港將媽祖神像迎接回家奉祀，歸途抵牛稠溪（朴子溪）南畔樸子樹下休息時，為附近群眾強求暫留供人膜拜。因媽祖發祥於樸仔樹下，是以標名為「樸仔腳」，「腳」臺語，「下面」之意。此係民前二百三十年之事。朴子詩人楊桂山有詩道：「大樸森森蔭樸津，開基一樹已歸神，覃思偉績同天后，長抱婆心護世人。」說明朴子與樸樹有關。』（邱奕松，民81，美哉嘉義，嘉義縣政府 出版）');
INSERT INTO "towns" VALUES (10010030, 10010, '嘉義縣', '布袋鎮', '1.布袋昔稱為『布袋嘴』，因為布袋位在鹽水溪口之北，以前環抱一個內灣，布袋就位在此內灣北岸突出的尖嘴上，故有此稱，後來則改為『布袋』。
2.布袋地名緣起於外繞沙嘴，深居潟湖內，似布袋狀而得名。昔稱「布大瑞」訛傳為「布袋嘴」，騷人墨客稱為「岱江」，也是日據時地方士紳以取七福神之布袋和尚雅號，以布袋延用至今。但「冬港」應為布袋最原始名稱，昔亦稱松仔港、蚊港、布袋嘴等。稱「松仔港」的原因是因台灣廈門交通，以布袋為捷徑，附近海水浴場壽島之松樹，蒼鬱青翠而得名。稱「蚊港」的原因是港邊蚊蟲為虐，六月間風平浪靜之際，更猖獗而有蚊港之稱。（邱奕松，民81，美哉嘉義，嘉義縣政府 出版）');
INSERT INTO "towns" VALUES (10010040, 10010, '嘉義縣', '大林鎮', '『大林』舊稱為『大莆林』，此地名之由來有兩種說法，一種說法係指本地在開墾初期乃為廣大的森林地帶，故有此稱；另一種說法為往昔此地有來自潮州府大埔之林地的移民，而有此稱。後來才改為『大林』。');
INSERT INTO "towns" VALUES (10010050, 10010, '嘉義縣', '民雄鄉', '民雄舊稱為『打貓』，『打貓』之地名是原來當地洪雅族打貓社的舊址，民國九年時，將『打貓』改為音近似日語之『民雄』，沿用至今。');
INSERT INTO "towns" VALUES (10010060, 10010, '嘉義縣', '溪口鄉', '本地舊稱為『雙溪口』，這是因為以前本地的聚落是建在石龜溪與三疊溪兩溪的會合處，後來則改稱為『溪口』。');
INSERT INTO "towns" VALUES (10010070, 10010, '嘉義縣', '新港鄉', '1.『新港』之地名即是指一個新開發的港口，這是指在清乾隆年間，原住於笨南港之大批漳州人，為了躲避洪水及漳泉械鬥之害，移居於此，久而久之，形成了街肆，發展成一個大市鎮，而有『新港』之稱。
2.新港原稱「麻園寮」，因乾隆初葉（一七四六前後）遍地胡麻叢生，因而得名。全鄉地勢平坦，早期因笨港溪（即今北港溪）氾濫，笨港市鎮被水沖毀，部份居民及沿笨港街官署遷徙此地，形成市鎮，改稱笨新港，後來以「笨」字不雅，而只稱「新港」。（邱奕松，民81，美哉嘉義，嘉義縣政府 出版）');
INSERT INTO "towns" VALUES (10010080, 10010, '嘉義縣', '六腳鄉', '六腳原名「六家佃」，相傳明永曆八年（一六四五）閩漳龍溪縣人陳士政等人招佃農六家戶人入墾，「家」臺語與「腳」相似，附近居民遂以「六腳佃」相稱。後來則改稱為『六腳』。（邱奕松，民81，美哉嘉義，嘉義縣政府 出版）');
INSERT INTO "towns" VALUES (10010090, 10010, '嘉義縣', '東石鄉', '本地在清嘉慶末年，有福建省泉州府晉江縣東石居民來此，開闢魚塭，並在港灣內養牡蠣為生，他們將原來故鄉的地名移植來此，也就稱此地為『東石』。');
INSERT INTO "towns" VALUES (10010100, 10010, '嘉義縣', '義竹鄉', '義竹舊稱為『義竹圍』，而『義竹圍』是由『二竹圍』更改過來的。『二竹圍』之由來，即是指第二個環植竹樹之村莊，因為在本地的西南方尚有一處環植竹樹之村莊，稱為『頭竹圍』。因為該地近海，冬季風力強，村民多植竹樹為牆，以防飛沙及禦盜。後來則改稱義竹');
INSERT INTO "towns" VALUES (10010110, 10010, '嘉義縣', '鹿草鄉', '鹿草舊稱為『鹿仔草』，這是因為往昔該地為鹿仔草茂生之地，故有此稱，後來則改稱為『鹿草』。據臺灣府志載「鹿仔草即楮樹也，以其枝葉為鹿所嗜，因名之。」（邱奕松，民81，美哉嘉義，嘉義縣政府 出版）');
INSERT INTO "towns" VALUES (10010120, 10010, '嘉義縣', '水上鄉', '水上舊稱為『水堀頭』，這是因為本地恰位於水圳之源頭，後來則根據原意，改稱為『水上』，亦即是位於水圳上源地帶的地方。');
INSERT INTO "towns" VALUES (10010130, 10010, '嘉義縣', '中埔鄉', '『中埔』之地名由來是與本地南南東方之頂埔及東北方竹崎鄉境內之內埔之相對位置而言。『埔』即是未墾之荒地。');
INSERT INTO "towns" VALUES (10010140, 10010, '嘉義縣', '竹崎鄉', '地名緣起於全鄉大部份為山坡地形，又多竹林，經砍伐開墾後，遍處留存許多竹頭，因此稱為「竹頭崎庄」。民國九年改稱竹崎。（邱奕松，民81，美哉嘉義，嘉義縣政府 出版）');
INSERT INTO "towns" VALUES (10010150, 10010, '嘉義縣', '梅山鄉', '梅山舊稱為『梅仔坑』，因為本地位於倒孔溪南岸的寬闊坑谷內，而且這一帶往昔是以梅花著稱，故有此稱。後來則改為『梅山』。
另有一說為：本地位處山腳地帶，為行旅必經之地，有人在溪畔築屋，販售「米糕粥」，閩人稱粥為「糜」，乃稱本地為「糜仔坑」。（邱奕松，民81，美哉嘉義，嘉義縣政府 出版）');
INSERT INTO "towns" VALUES (10010160, 10010, '嘉義縣', '番路鄉', '『番路』之地名由來於本地恰位於通往阿里山曹族番社的要道之上，故有此稱。');
INSERT INTO "towns" VALUES (10010170, 10010, '嘉義縣', '大埔鄉', '大埔昔稱『後大埔』，因為在台南縣東山鄉境內，有較早形成之大埔庄，因此本地之大埔改稱為後大埔，台南縣者稱為前大埔，以資區別。『大埔』是潮州府下的縣名，因為本地初期的入墾者，大多從潮州府之大埔而來，移民們便將原鄉的地名移植於此，後大埔於民國九年時改稱大埔，而沿用至今。');
INSERT INTO "towns" VALUES (10010180, 10010, '嘉義縣', '阿里山鄉', '本鄉原名吳鳳鄉，為紀念康熙末年阿里山通事吳鳳而取之名。民國七十 年改稱為『阿里山鄉』。');
INSERT INTO "towns" VALUES (10013010, 10013, '屏東縣', '屏東市', '屏東市昔稱「阿猴」，是原住民方言諧音；後來又成為平埔族阿猴社民的部落，所以也稱「猴社」、「阿猴寮」。又由於全市的地形好像一隻坐著的猴子，故稱「阿猴」，日據時期因猴字不雅而將「犬」部改為「糸」部。後來發現此地是位於高雄半屏山之東，所以按照位置來取名為「屏東」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁31）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013020, 10013, '屏東縣', '潮州鎮', '清雍正四年（西元1726年）廣東省潮州府住民進來開發，為了紀念他們的老家，故沿用其名，稱此地為「潮州」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁45）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013030, 10013, '屏東縣', '東港鎮', '古稱「東津」（津指海邊的意思），原本是平埔族「放索社」群居地，明末清初渡海而來的先民漸漸增多，和福建生意往來興盛，而當時帆船停靠的港區就在百姓定居地東邊，故稱「東港」。（屏東縣政府編，民84，屏東縣國民小學鄉土教材）
另有一說：由於位居大陸「東」方的海「港」，故稱「東港」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁52）');
INSERT INTO "towns" VALUES (10013040, 10013, '屏東縣', '恆春鎮', '舊名「琅喬」，原意是本地出產的一種蘭科植物，也是排灣族稱呼。清同治十三年（西元1874年）牡丹社事件後，沈葆楨親自到此巡視，見此地氣候涼爽，四季如春，故奏准設縣，取名「恆春」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁62）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013050, 10013, '屏東縣', '萬丹鄉', '地名由來有二說：
1.據說在清同治年間，兩岸商船在萬丹小溪（今大湖橋）附近貿易，成為內港並形成萬舟景觀，就以「萬舟」為名。後來因為高雄港、東港先後成港而沒落，盛況不再，將「舟」改為「丹」取名「萬丹」。（屏東縣政府編，民84，屏東縣國民小學鄉土教材）
2.本地早期屬於西拉雅平埔族居住地，「萬丹」一名可能是當年平埔族Moanun社和Paugdaudang上下淡水兩社的合稱。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁249）');
INSERT INTO "towns" VALUES (10013060, 10013, '屏東縣', '長治鄉', '本地屬西拉雅平埔族居住地之一，明清及光復時期漢人大批移入，在光復之前稱為『長興庄』。『長興』可能是當初拓墾時之墾號，光復後為期盼「長治久安」，故稱「長治」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁279）');
INSERT INTO "towns" VALUES (10013070, 10013, '屏東縣', '麟洛鄉', '早期屬西拉雅平埔族生活領域，可能當時有平埔「麟洛」社，清廷記為「玲路」。清康熙年間嘉應州徐俊良先賢來此開墾，在開設水圳時發現大烏龜，地理師說：出現大龜的地方一定有麒麟，這裡是麟趾呈祥的好地方，就取地名為「麟落庄」，後來改稱為「麟洛」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁243）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013080, 10013, '屏東縣', '九如鄉', '相傳最初是由九戶人家遷來此地定居，早期稱為「九塊厝」，後因有感「九塊」不雅，取三多九如之意，改為「九如」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁273）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013090, 10013, '屏東縣', '里港鄉', '地名由來有二說：
1.原名「過港仔」，相傳在清康熙年間，有一名叫「阿里」的年輕人來此謀生，以販賣冷飲為生，商業逐漸的繁榮，人口增加，乾隆年間就稱此處為「阿里港」，民國九年日人改稱為「里港」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁76）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）
2.本地舊稱為『阿里港』，在漢人及平埔族尚未移入之前，曾有傀儡番（魯凱族）居住於此，在漢人移民入墾後，便譯『傀儡』音為『阿里』，再加上本聚落建在隘寮溪之南，故拼成原地名為『阿里港』，後來則改稱為『阿里』');
INSERT INTO "towns" VALUES (10013100, 10013, '屏東縣', '鹽埔鄉', '本鄉是介於山地與平原之間的一片草埔，原本是平埔族居住地，明朝福建省葉唐山來到此地，用十台車的食鹽，外加一車煙酒火柴交換這片土地，又因為當時介於平地之間的草原地帶常被稱為「埔」，故命名為「鹽埔」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁86）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）另有一說：清代時這一帶溪埔地含鹹重，故稱本地為『鹹埔莊』，後來才改稱為『鹽埔』。');
INSERT INTO "towns" VALUES (10013110, 10013, '屏東縣', '高樹鄉', '本地原名「大車路」，因為高樹路寬，可同時容納多輛牛車行走。地名由來有二說：
1.舊時庄頭有一株木棉樹，樹身高大，形狀就如一個大車蓋故取名為「高樹」。
2.漢人開墾初期，在「高」位河階處建立聚落，又因此地屬於河川網路縱橫區，水量充沛長滿高大的「樹」林，故稱「高樹」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁95）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013120, 10013, '屏東縣', '萬巒鄉', '地名由來有二說：
1.先民初墾時，見大武山翠峰綿延如「萬」座「巒」峰，遂以此命名。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁31）
2.清代時期此地隨處可捉到鰻魚，民眾乃稱此處為萬鰻，後因「鰻」與「巒」客家語發音近似，慢慢就成為「萬巒」。（屏東縣萬巒鄉公所編印，屏東縣萬巒鄉簡介）');
INSERT INTO "towns" VALUES (10013130, 10013, '屏東縣', '內埔鄉', '本地早年是一片茂密的森林，來開墾的先民首先在森林中間開闢出一片旱田，客家話稱為「埔」，又因在森林裡，故稱為「內埔」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁300）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）。『內埔』是指在內方之未墾埔地，本地在清康熙年間，由閩、粵籍移民墾成。');
INSERT INTO "towns" VALUES (10013140, 10013, '屏東縣', '竹田鄉', '地名由來有二說：
1.本地以前有一條街道，路旁商家囤積商品於此，所以稱為「屯物」。日治時期改為「竹田」，竹是農村，田是農田，本鄉因為是竹園多於水田的鄉村，故改名為「竹田」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁31）
2.本地原稱為『頓物潭』，昔有池沼，是住民丟棄廢物之處，故有此稱。民國九年時，改稱為竹田，係日式地名。');
INSERT INTO "towns" VALUES (10013150, 10013, '屏東縣', '新埤鄉', '清代客家漢人在此建立人工蓄水池「埤」以利耕種，在埤的前方建立新的聚落叫做「新埤頭」，與內埔鄉之老埤南北相互對稱，日據時期去「頭」簡稱「新埤」。另一說為「新埤」取名自新築埤頭以灌溉的意思。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁127）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）。');
INSERT INTO "towns" VALUES (10013160, 10013, '屏東縣', '枋寮鄉', '早期此地林木茂盛，而且出產高貴的「檀木」，俗稱「枋仔樹」。清初開墾的先民砍樹木搭工寮暫住，後來漸漸形成聚落，「枋寮」就是如此命名，其意為用木板搭建工寮居住的地方。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁133）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013170, 10013, '屏東縣', '新園鄉', '明末福建黃上房等人渡海來此，將高屏溪旁原野開墾為田園，至清乾隆年間，多已墾成，並形成各村莊，因為建庄於新闢成之園（旱田），故稱之為『新園』。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁138）');
INSERT INTO "towns" VALUES (10013180, 10013, '屏東縣', '崁頂鄉', '本地地勢高亢，四周地勢低平，有河水流過，雨季常淹水，只有此處免於水患，就將此處取名「崁頂」，取其地勢高適合居住的意思。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁150）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013190, 10013, '屏東縣', '林邊鄉', '早期是林木茂盛的原野，所以取名「林仔邊」。先民進入開墾，在「林」區「邊」緣建立部落，日據時期以「林邊」統一稱呼本鄉。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁158）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013200, 10013, '屏東縣', '南州鄉', '本鄉位於屏東「溪洲」溪「南」岸的地帶，原名叫「溪州」，隸屬於林邊鄉，後來分出成為溪州鄉，因台灣太多地方稱溪州，加上位於台灣南端，故改名為「南州鄉」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁311）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013210, 10013, '屏東縣', '佳冬鄉', '本地原稱六根，開拓最初周圍很多茄苳樹，所以又叫「茄苳腳」，日據時期簡化地名時，由於臺語「茄苳」與日語「佳冬」相近，故改名為「佳冬」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁320）另有一說：佳冬原稱為『茄苳腳』，是來自本地馬卡道族之茄藤社，因為茄藤與樹名『茄苳』近音，乃變更為慣稱的地名『茄苳腳』為本地之地名，在民國九年時，才更改為『佳冬』。');
INSERT INTO "towns" VALUES (10013220, 10013, '屏東縣', '琉球鄉', '相傳清乾隆二十年（西元1755年）有住打狗港（今高雄港）人李月老，來到島上開墾並從事漁業，孤島好像一個浮沈的球，面積又小，故稱「小琉球」。民國九年日人簡化為「琉球鄉」。（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013230, 10013, '屏東縣', '車城鄉', '地名由來有下列說法：
1.先民為了要抵禦原住民攻擊，就用載農作物的牛車圍繞成牆用以築城，於是大家就稱此地為「車城」。
2.有一次先民路經此地突然遭原住民襲擊，大家就用牛車圍成一個城堡來抵抗，終於戰勝，為了紀念就稱此地為「車城」。
3.原住民因為常侵襲先民，所以他們在沒有築城的北面堆積木材做城防，後來怕被燒，就改用牛車數十輛佈置在外，於是就叫此地為「車城」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁184）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013240, 10013, '屏東縣', '滿州鄉', '原名「蚊蟀埔」，是排灣族所住。因為原住民打獵收獲很多，吃不完只好丟棄在原野上，久而久之造成臭氣難聞，排灣族臭氣譯音即為「蚊蟀」。後來因字義不雅而改為「滿州鄉」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁294）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013250, 10013, '屏東縣', '枋山鄉', '相傳古時枋山村附近有座山突然崩裂，乃命名為「崩山」，後來因為不雅，就用閩南語諧音「枋山」代替。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁203）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）（屏東縣枋山鄉公所編印，屏東縣枋山鄉簡介）');
INSERT INTO "towns" VALUES (10013260, 10013, '屏東縣', '三地門鄉', '原地名為「音斯笛摩兒」，屬於魯凱族『三地門』社的聚落，『三地門』是漢譯音，以前亦做『山豬毛社』。光復後，本地設鄉，便取名為『三地』鄉。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁208）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013270, 10013, '屏東縣', '霧臺鄉', '本地原為西魯凱族「傀儡」群「霧臺」社居住地，魯凱語「霧臺」指許多小社聚集成的大社，光復後獨立為「霧臺鄉」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁216）');
INSERT INTO "towns" VALUES (10013280, 10013, '屏東縣', '瑪家鄉', '本地原為西排灣族「瑪家雜牙雜牙」社居住地，排灣語「瑪家雜牙雜牙」指傾斜的山坡地，光復後簡稱為「瑪家鄉」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁329）');
INSERT INTO "towns" VALUES (10013290, 10013, '屏東縣', '泰武鄉', '本鄉位於北大武山和南大武山之間，由於台東縣已有「大武鄉」，因此光復後，本地改名「泰武」鄉以示區別。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁237）');
INSERT INTO "towns" VALUES (10013300, 10013, '屏東縣', '來義鄉', '本地日據時期稱為來社，含有重義氣、倫理及情感的意思。光復後為了發音方便而改稱「來義」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁237）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013310, 10013, '屏東縣', '春日鄉', '中央山脈西側山區為排灣族大本營，本地有「喀蘇柏幹」大社，日據時期由於日語「春日」讀音為「Kasuga」，與社名相近，便簡化為「春日」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁335）');
INSERT INTO "towns" VALUES (10013320, 10013, '屏東縣', '獅子鄉', '本鄉內獅村附近有一小山丘，形狀很像獅子，人稱「獅頭山」，因為鄉公所位於此，故稱本鄉為「獅子鄉」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁229）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10013330, 10013, '屏東縣', '牡丹鄉', '地名由來有二說：
1.由山地話「新保將」翻譯而來，加上本地境內盛產野牡丹，因此稱為「牡丹鄉」。
2.先住民排灣族蘇侉侉羅雷支族「趴立拉力克」牡丹社分佈地，故簡稱「牡丹」鄉。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁263）（屏東縣政府編，民84，屏東縣國民小學鄉土教材）');
INSERT INTO "towns" VALUES (10014010, 10014, '臺東縣', '臺東市', '清光緒年間，台灣建省之後，增設直隸州於此，當初以其位居台灣之東部，故命名為台東直隸州，『台東』之地名便是由此而來。臺東以前為卑南、阿美族定居之地，清咸豐五年才有漢人與平埔族移入，道光年間形成聚落稱「寶桑莊」，光復後設鎮「臺東鎮」，民國六十五年升為市。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁529）');
INSERT INTO "towns" VALUES (10014020, 10014, '臺東縣', '成功鎮', '成功昔稱為『麻荖漏』，是當地阿美族『麻荖漏』社的漢譯社名，民國九年時，改稱為新港，由來於當地為東海岸輪船重要停泊港之一。光復後，以其相近之日語讀音，改以吉祥的近音字『成功』為地名。');
INSERT INTO "towns" VALUES (10014030, 10014, '臺東縣', '關山鎮', '本鄉原名「里壟」，由高山族語「ㄉㄧ ㄌㄢˋ ㄉㄧ ㄌㄢˋ」，即「紅蟲」翻譯成音。民國四十三年更名為「關山鎮」。因為本地的山勢逼近，就像一個關隘，故有『關山』之稱。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁549）');
INSERT INTO "towns" VALUES (10014040, 10014, '臺東縣', '卑南鄉', '因為本地為卑南族之卑南社的聚落，所以稱為『卑南』。一百八十多年前卑南族大頭目「鼻那來」(Pinara)聰明蓋世，傳說有漢人血統，建立典章與納稅制度，發展迅速統治臺東縱谷，又控制附近大族，荷蘭人稱為「卑媽拉」(Pimala)，漢人簡稱為「卑南」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁564）');
INSERT INTO "towns" VALUES (10014050, 10014, '臺東縣', '鹿野鄉', '地名由來有二說：
1.日據時期日本移民來此開墾種植甘蔗，由於附近有原住民「鹿寮」社，又多「野」生景觀，故稱「鹿野」。
2.本鄉昔日為荒野之地，常有鹿群棲息，故稱「鹿野」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁586）');
INSERT INTO "towns" VALUES (10014060, 10014, '臺東縣', '池上鄉', '由於本地之東南方有一大水池，因此乃以聚落是位於大水池之西北方，故稱此地為『池上』。');
INSERT INTO "towns" VALUES (10014070, 10014, '臺東縣', '東河鄉', '本地舊稱為『大馬武窟社』，這是由阿美族的譯音轉換而來的漢字，其意思為『投網捕魚之處』。光復後，以其位在台東海岸山脈東側最大河川馬武窟溪之東端河口位置，而改稱為『東河』。');
INSERT INTO "towns" VALUES (10014080, 10014, '臺東縣', '長濱鄉', '本地舊稱為『加走灣』，是阿美語的漢字譯音地名，其意思為『守望之處』，在以前清軍來攻之時，阿美族人曾在此瞭望清軍之動靜。民國二十六年時，因為本地位在海蝕岩台上，其下為石坑溪所形成之沖積扇，堆積物砂礫連續很長，故改稱為『長濱』。');
INSERT INTO "towns" VALUES (10014090, 10014, '臺東縣', '太麻里鄉', '本地昔稱朝貓籬，其義不明。是太麻里溪出海口沖積成的肥沃三角洲平原，「太麻里」就是原住民土著話，指太陽照耀肥沃的地方。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁658）');
INSERT INTO "towns" VALUES (10014100, 10014, '臺東縣', '大武鄉', '本地原為排灣族巴卡羅群分佈地帶，位在南部中央山脈「大武山」餘脈之南，所以原稱為『南大武』，日據時期改稱「大武」，而沿襲至今。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁631）');
INSERT INTO "towns" VALUES (10014110, 10014, '臺東縣', '綠島鄉', '本鄉以島名為鄉名。本島舊稱為『火燒島』，另一舊稱為雞心嶼，即以該島之形狀類似雞之心臟而名。
火燒島地名之起源有二說：
1.相傳島上漁民出獵海上，遇風雨常迷失，故經常在山頂燃燒柴火為標識，遠望之而稱為火燒島。
2.相傳百餘年前漁船在傍晚歸航時，遠望這座被夕陽染紅的島嶼，就如熊熊火焰包圍一樣，故稱火燒島。
光復後政府因鑑於名稱不雅，並在島上展開綠化造林活動，所以改稱「綠島」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁602）');
INSERT INTO "towns" VALUES (10014120, 10014, '臺東縣', '海端鄉', '『海端』屬布農族生活圈「海多端王」(Haitotowan)社分佈此地，故擇音簡稱為「海端」，海拔一千公尺有海端村。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁635）');
INSERT INTO "towns" VALUES (10014130, 10014, '臺東縣', '延平鄉', '本鄉為布農族分佈地，日據時期為關山郡蕃地，光復後則取收復台灣之民族英雄延平郡王之『延平』為鄉名。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁644）');
INSERT INTO "towns" VALUES (10014140, 10014, '臺東縣', '金峰鄉', '本地舊稱為『虷仔崙』，這是譯自當地之阿美語，其意思為『雞母珠』，後來日據時期時，日人將『虷仔』，以日語中之同音字『金』代之，『崙』續用，而拼成『金崙』鄉之地名，後來又更改為金山鄉，因與台北縣金山鄉重疊，於是又改為現今之『金峰』鄉。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁651）');
INSERT INTO "towns" VALUES (10014150, 10014, '臺東縣', '達仁鄉', '本地原為排灣族『阿塱衛社』聚居之地，其意思為『聚集』，即眾多族人，為禦敵需要而逐漸聚集於此。鄉名取自安朔溪出海口平原區的「達仁」村。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁640）');
INSERT INTO "towns" VALUES (10014160, 10014, '臺東縣', '蘭嶼鄉', '本鄉以島名為鄉名。蘭嶼原稱為『紅頭嶼』，光復以後，以其為蝴蝶蘭之產地，故改稱為『蘭嶼』。關於紅頭嶼之由來，有以本島形狀類似紅頭船隻浮於水上，或云島上山頭夕陽照射時，遠望之，呈紅色，故有此稱；另有一種說法是，因為島上之山腹多處有紅土層暴露出，故有此稱。');
INSERT INTO "towns" VALUES (10015010, 10015, '花蓮縣', '花蓮市', '在花蓮溪口一帶，由於外海港灣有黑潮暖流由南向北流，碰到凸出的海岸地，溪水注入和海浪衝擊形成「洄瀾狀」，漢人見了，就把這處海港叫做「洄瀾港」；由於台語「洄瀾」和「花蓮」發音相近，清代時雅化為「花蓮港」，日據時期簡稱「花蓮」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁373）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁50）');
INSERT INTO "towns" VALUES (10015020, 10015, '花蓮縣', '鳳林鎮', '地名由來有二說：
1.舊稱「馬里勿」，為上坡之意。早期森林茂密，木蘭繞樹生長就如鳳鳥展翅，漢人來開墾就命名為「鳳林」。
2.另一說法是由於清代屬台東直隸州「奉」鄉，「奉」與「鳳」同音，且位於「西鳳林山」東麓地區，南有「鳳」信村，北有「林」榮村，故位在中間交通要站稱為「鳳林」鎮。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁395）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁59）');
INSERT INTO "towns" VALUES (10015030, 10015, '花蓮縣', '玉里鎮', '玉里  舊稱「璞玉閣」，一說是阿美族的譯音，意義為灰塵，因秀姑巒溪縱貫境內，若久不下雨則溪水乾涸，風吹沙土灰塵蔽日。二說是出自「派派可」之譯音，阿美族稱「蕨」為派派可，本地以產蕨得名。三說為此地大理石就如未磨的「璞」玉「石」，官兵在此又建立「閣」樓街道，故稱「璞玉閣」。日據時期簡化地名，因「璞」是未磨之「玉」，故改稱「玉里」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁387）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁64）');
INSERT INTO "towns" VALUES (10015040, 10015, '花蓮縣', '新城鄉', '昔日泰雅族稱新城一帶為「大魯宛」，漢語譯做「哆囉滿」。清嘉慶年間，淡水廳吳全率領所募到的民眾到此墾荒，太魯閣社民屢出攻擊，就築城防禦，取名「新城」。在公文首見是清同治十三年（西元1874年）閩浙總督沈葆楨，奏准開築台灣後山三路，光緒元年（西元1875年）羅大春築北路自宜蘭、蘇澳至花蓮，路通後移民在此地建立新聚落，故命名為「新城」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁494）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁54）');
INSERT INTO "towns" VALUES (10015050, 10015, '花蓮縣', '吉安鄉', '清代此地為阿美族崇爻九社之一『竹腳宣社』的所在地，日據時期稱為『七腳川社』，後有日本移民於此，稱為吉野村，台灣光復後設「鄉」，因吉野二字含有日本語意色彩，且為求各族和平共存「吉」祥「安」定，故稱「吉安鄉」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁403）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁56）');
INSERT INTO "towns" VALUES (10015060, 10015, '花蓮縣', '壽豐鄉', '本鄉舊稱「里鬧」，泰雅語叢林之意，後來為阿美族狩獵地。清光緒元年（西元1875年）羅大春築北路自宜蘭、蘇澳至花蓮，在奇萊山一帶有一小山北側天然湖泊，潭中有許多鯉魚，稱之「鯉魚潭」，潭南方的小山稱「鯉魚山」，壽豐位於鯉魚山南端，故又稱「鯉魚尾」。台灣光復後取附近的「壽」村及日據時期日本移民村「豐」田村之壽豐二字，合稱「壽豐鄉」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁414）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁58）');
INSERT INTO "towns" VALUES (10015070, 10015, '花蓮縣', '光復鄉', '這一帶為阿美族馬太鞍社域，到了民國二十六年，日人改馬太鞍為上大和。光復後有鑑於大和為日本上古國名又為其民族名，於是改稱為光復。');
INSERT INTO "towns" VALUES (10015080, 10015, '花蓮縣', '豐濱鄉', '清嘉慶年間，本地居民以阿美族為主，他們社名的漢譯音為『貓公』，所以往昔此地稱為『貓公』，日據時期是隸屬於鳳林郡新社庄。光復後因貓公二字地名不雅，又因本鄉東臨太平洋，漁產豐富，海岸風景宜人，故改名為「豐濱鄉」。（花蓮縣壽豐鄉公所編印。花蓮縣壽豐鄉簡介）（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁476）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁69）');
INSERT INTO "towns" VALUES (10015090, 10015, '花蓮縣', '瑞穗鄉', '本地阿美族稱「可可」，意為平原遼闊之意。漢人稱『水尾』，因為此地位於富源溪、紅葉溪水納入秀姑巒溪末段，東入注海的各溪尾之處，所以得稱。日據時期日本移民來此，鑑於此地稻米農作結穗纍纍，而以日本神社「豐葦原之瑞穗國」的字句改稱「瑞穗」，祈求豐收。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁423）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁61）');
INSERT INTO "towns" VALUES (10015100, 10015, '花蓮縣', '富里鄉', '本鄉開發始於清道光九年（西元1892年），由於地廣人稀，土壤肥沃，漸漸形成聚落，稱為「公埔」，即指「公有待墾的一片小小平原」，為平埔族公共牧場。民國二十六年日人以土地肥沃，取「富裕鄉里」吉祥之意，更名為「富里」。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁434）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁68）');
INSERT INTO "towns" VALUES (10015110, 10015, '花蓮縣', '秀林鄉', '秀林是太魯閣群泰雅族社名之譯音。社名原義是菅茅經砍伐燒燬後，再長出幼牙之處。現名除譯其音外，又寓意『山林之秀』。');
INSERT INTO "towns" VALUES (10015120, 10015, '花蓮縣', '萬榮鄉', '萬榮是日據時期的『森阪村』。民國四十七年改名「萬榮鄉」，地名由來是因為該村在萬里溪南岸，所以取『萬』字，加吉祥義之『榮』字拼成。（花蓮縣萬榮鄉公所編印，花蓮縣萬榮鄉鄉政簡介）（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁452');
INSERT INTO "towns" VALUES (10015130, 10015, '花蓮縣', '卓溪鄉', '此地原稱「巴內大」，由於當地溪流除大雨外，終年無水，所以昔日名為「乾溪」。光復後成立鄉治，改名「卓溪鄉」。鄉名取自布農族中布農族群卓社、卡社群之譯音。（花松村，民85，台灣鄉土全誌（九）。台北：中一，頁486）（苗允豐編，民72，花蓮縣治（卷二）。花蓮文獻委員會出版，頁83）');
INSERT INTO "towns" VALUES (10016010, 10016, '澎湖縣', '馬公市', '馬公舊稱為『媽宮』，相傳在明初，移民在今天的正義街十九號創建『娘媽宮』，為全台最早創建的廟宇，地名刪去『娘』字稱『媽宮』，民國九年改稱為『馬公』。');
INSERT INTO "towns" VALUES (10016020, 10016, '澎湖縣', '湖西鄉', '在澎湖島之東，有大武山與尖山，兩山之間為一小盆地，內有窪地瀦成一小湖，在其東西各有一村，稱為湖東、湖西，湖西之地名由此而來。');
INSERT INTO "towns" VALUES (10016030, 10016, '澎湖縣', '白沙鄉', '以白沙島名為地名。白沙島一帶，因佈滿珊瑚砂礫，陽光照耀下，遠眺就像白沙成環帶一般，所以得稱。');
INSERT INTO "towns" VALUES (10016040, 10016, '澎湖縣', '西嶼鄉', '西嶼因位於澎湖本島西方大島嶼而得稱。 今稱為漁翁島，乃是西人的譯音地名。');
INSERT INTO "towns" VALUES (10016050, 10016, '澎湖縣', '望安鄉', '望安島舊稱為八罩島，因附近有八個島嶼而得名。望安原稱為網垵，因為過去漁夫在凹灣處曬網而得名。近來也有人說，鄭成功由金門率艦隊經七美嶼，遙望八罩島，希望能平安抵達，故得稱。');
INSERT INTO "towns" VALUES (10016060, 10016, '澎湖縣', '七美鄉', '七美島以前稱為南天島、大嶼、南嶼等，位於澎湖群島之最南，因為有七美人貞節故事，所以於民國三十八年，改稱為七美嶼。');
INSERT INTO "towns" VALUES (10017010, 10017, '基隆市', '中正區', '平埔『凱達格蘭』族老家，漢人聽成河洛語的『雞犬加籠』，後簡稱『雞籠』，清代把『雞籠』改稱『基隆』表示『基地昌隆』。
  原叫『八尺門』，與基隆港外的和平島以橋相連，光復後為紀念故總統蔣中正才改名。');
INSERT INTO "towns" VALUES (10017020, 10017, '基隆市', '七堵區', '先民拓墾時期，防止當地先住民各族入侵的土牆，七堵就是第『七』座『堵』牆');
INSERT INTO "towns" VALUES (10017030, 10017, '基隆市', '暖暖區', '平埔族暖暖社的故鄉');
INSERT INTO "towns" VALUES (10017040, 10017, '基隆市', '仁愛區', '原名『石牌街』，光復後改為仁愛區');
INSERT INTO "towns" VALUES (10017050, 10017, '基隆市', '中山區', '  基隆港區有『白米甕』老地名傳說，光復後為紀念 國父孫中山先生才改名');
INSERT INTO "towns" VALUES (10017060, 10017, '基隆市', '安樂區', '取自區內的『安』和里及『樂』一里的里名');
INSERT INTO "towns" VALUES (10017070, 10017, '基隆市', '信義區', '原叫『田寮港』，光復後取自『八德』中第五、六德『信』、『義』作為行政區名。');
INSERT INTO "towns" VALUES (10018010, 10018, '新竹市', '東區', '新竹舊名為『竹塹』，緣於本地以前為平埔族中的道卡斯族之竹塹社的居住地而來。清雍正元年之後，本地成為『淡水廳』的所在地，一直到光緒元年，台北建府後，改淡水廳為『新竹縣』，才有新竹的地名。『新竹』的意義，乃是指在竹塹所新設之縣。或云取竹塹之竹字，期其地之日新又新，故名新竹。
  新竹市在民國71年升格為省轄市後，於民國79年行政區才畫分為東區、北區、香山區等三區。本區（東區）位於新竹市的東南部。');
INSERT INTO "towns" VALUES (10018020, 10018, '新竹市', '北區', '本區（北區）位於新竹市的北部。');
INSERT INTO "towns" VALUES (10018030, 10018, '新竹市', '香山區', '本區原為新竹縣的香山鄉，在民國71年新竹市升格為省轄市時，併入新竹市。而香山地名之由來，傳說有二，據香山鄉公所調查：鄭成功治台時代，此地為竹塹社番所居，當時尚未有固定名稱，等到漢人大量遷居此地之後，眼見大坪頂一帶，漫山遍野有一種無名花草盛開，氣味芬香迷人，故稱之為「香山」。另一種說法來自於鹿仔坑秀才林秀春派之傳說：香山地方往昔為竹塹社番的所在地，故初來於此的漢人均稱此地為「番山」，等到後來漢人越來越多，而番人越來越少時，覺得此地名不雅，經眾人商議之後，改「番山」為「香山」，蓋因「番」與「香」之字音相近，而「香」乃「番」減去三筆之字也。');
INSERT INTO "towns" VALUES (10020010, 10020, '嘉義市', '東區', '地名由來有二說:
1.嘉義昔稱『諸羅山』，這是出自於當地的平埔族洪雅族『諸羅山』社之譯音。
2.由於本地地形諸山羅列，故原名諸羅。後因清乾隆51年(西元1786年)林爽文之亂，淡水、彰化曾先後陷落，豬羅被困，軍民不屈，清高宗獲悉乃於次年賜名為嘉義，以示嘉許全城軍民義舉。');
INSERT INTO "towns" VALUES (10020020, 10020, '嘉義市', '西區', '民國七十九年（1990年）10月6日，嘉義市政府統合日治時代昭和7年（1932年）町名改正設置的玉川町、榮町、西門町、新富町、黑金町、末廣町、白川町、埤子頭、北社尾、竹圍子、車店、竹子腳、大渓厝、柴頭港、港子坪、劉厝設置西區。');
INSERT INTO "towns" VALUES (63000010, 63000, '臺北市', '松山區', '平埔族錫口社的故居，日本人改為松山。');
INSERT INTO "towns" VALUES (63000020, 63000, '臺北市', '信義區', '民國79年把松山區鐵路以南、及大安區和平東路以北獨立分出而來');
INSERT INTO "towns" VALUES (63000030, 63000, '臺北市', '大安區', '由於（大灣庄），（灣）和（安）的諧音而得名');
INSERT INTO "towns" VALUES (63000040, 63000, '臺北市', '中山區', '台灣光復後為紀念孫中山先生。');
INSERT INTO "towns" VALUES (63000050, 63000, '臺北市', '中正區', '民國79年將古亭區和城中區合併為中正區。而古亭區地名之由來乃因由（古亭苯）這種裝稻穀的建物得名。或擊鼓示警的（鼓亭）而來。至於城中區地名之由來，是因為位於古台北城的城池中央。');
INSERT INTO "towns" VALUES (63000060, 63000, '臺北市', '大同區', '由（大）隆（同）而來。');
INSERT INTO "towns" VALUES (63000070, 63000, '臺北市', '萬華區', '舊名艋舺，亦作「蟒甲」、「文甲」、「莽葛」，為凱達喀蘭族語MOUNGAR之音譯，意指獨木舟及獨木舟聚集之地，其地濱河，土壤膏腴。初僅凱達喀蘭族在此居住，除射魚維生外，兼以所產苦茗、蕃薯等物，以獨木舟載運至淡水河上游新店溪，與漢人交易，遂得「艋舺」之名。');
INSERT INTO "towns" VALUES (63000080, 63000, '臺北市', '文山區', '民國79年把景美區和木柵區合併為文山區。而景美區地名之由來乃因古人用木頭或竹子製作的大水槽稱作（筧）或（木見），在水槽尾端部份叫（木見尾）、（筧尾），後來叫成（景尾），再改為景美。至於木柵區地名之由來，乃因漢人與原住民抗爭時代，漢人在景美溪邊興建木製的大型柵欄，防止敵人入侵。');
INSERT INTO "towns" VALUES (63000090, 63000, '臺北市', '南港區', '因地處基隆河之南，有港可以泊舟故名。');
INSERT INTO "towns" VALUES (63000100, 63000, '臺北市', '內湖區', '位於台北盆地內側的盆地。');
INSERT INTO "towns" VALUES (63000110, 63000, '臺北市', '士林區', '舊名八芝蘭，康熙四十八年，陳賴章集團亦入墾此區。至清末，科名特盛，文風蔚起，改稱士林，取士子如林之意。');
INSERT INTO "towns" VALUES (63000120, 63000, '臺北市', '北投區', '平埔族的語言，北投就是指女巫。');
INSERT INTO "towns" VALUES (64000010, 64000, '高雄市', '鹽埕區', '  此地原為西拉雅平埔族打狗社居住地，日據時期日本人把河洛語（打狗）改成與日語發音相近的─高雄（Taka），因此改稱為高雄沿用至今。明鄭時期和清代有漢人開發為曬鹽區，河洛語廣場叫做（埕），如今為行政中心，依然保留開拓之初『鹽埕』的原始地名。');
INSERT INTO "towns" VALUES (64000020, 64000, '高雄市', '鼓山區', '三百多年前這裡是西拉雅平埔族打狗牙社活動區域，漢人稱之為『打鼓社』，且此地有一小山丘（萬壽山），其狀兀然凸起有如『鼓』狀，故稱鼓山。');
INSERT INTO "towns" VALUES (64000030, 64000, '高雄市', '左營區', '明鄭時實施屯田政策，本區以『左營』之部隊進行開墾，故稱之');
INSERT INTO "towns" VALUES (64000040, 64000, '高雄市', '楠梓區', '昔日此地盛產『楠木』和『梓木』，又是木匠集中區，『梓人』就是『木匠』的意思，故稱『楠梓』。');
INSERT INTO "towns" VALUES (64000050, 64000, '高雄市', '三民區', '本鄉居民以布農族為主，並有少數曹族與排灣族的居民。在光復後，本地才設鄉，由於境內有民權、民族、民生三村，皆冠有『民』字，寓有『三民主義』的政治理想，故將此地命名為『三民』鄉。');
INSERT INTO "towns" VALUES (64000060, 64000, '高雄市', '新興區', '為『新興』的商業精華區，故稱之為新興區');
INSERT INTO "towns" VALUES (64000070, 64000, '高雄市', '前金區', '昔日可能是明鄭時代實施屯田制度時，為『前金』營的拓墾區，故而稱之。');
INSERT INTO "towns" VALUES (64000080, 64000, '高雄市', '苓雅區', '三百多年前明鄭萬曆年間漢人入墾，在本區的松樹根上發現有球塊狀『茯苓仔』，漢人搭寮採集，故稱『苓雅寮』，台灣光復後改為『苓雅』區。');
INSERT INTO "towns" VALUES (64000090, 64000, '高雄市', '前鎮區', '明鄭時期實行屯田政策，本區屬於『前鎮』軍營開墾區，故稱前鎮區。');
INSERT INTO "towns" VALUES (64000100, 64000, '高雄市', '旗津區', '本區為長條形海岸外的隆起沙洲，有如一支『旗』子橫在港外，『津』就是過渡陸地或港口必經的地方，故稱『旗津』，北端形成高雄港，南端形成小港。');
INSERT INTO "towns" VALUES (64000110, 64000, '高雄市', '小港區', '清末由於泥沙淤積，使當時的『鳳山港』衰落成為小港叫作『港仔土乾』，日據時期把『港仔土乾』改稱『小港』');
INSERT INTO "towns" VALUES (64000120, 64000, '高雄市', '鳳山區', '鳳山舊稱為『下坡頭街』，後來稱為『埤頭街』。由於境內有一弧列狀隆起的珊瑚礁台地，稱為鳳山，所以清代取山名為縣名，稱為鳳山縣。');
INSERT INTO "towns" VALUES (64000130, 64000, '高雄市', '林園區', '本鄉原稱為『林子邊』，因在今日林園、東林二村境內，曾是森林茂密之地，早期移民在其邊緣處建村，所以得名。民國九年改稱為林園，光復後沿用至今。');
INSERT INTO "towns" VALUES (64000140, 64000, '高雄市', '大寮區', '清廷曾將此地一帶之荒埔，賜予平台有功的施琅將軍，以為世襲業產。於是施家招來大批佃農入墾，可能初墾時曾築有大型茅寮於此，所以得稱。另有一說：本地在康熙時百姓聚集休息的場所可分為「溪埔寮」、「潮州寮」、「頂大寮」、「下大寮」等四座，日後，將四寮合而為一，改稱「大寮」。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000150, 64000, '高雄市', '大樹區', '大樹舊稱為大樹腳，相傳在明鄭時期有一將領逐退原住民，屯墾於此，因為在大樹之下建村莊，因而得名。');
INSERT INTO "towns" VALUES (64000160, 64000, '高雄市', '大社區', '大社以前是平埔族西拉雅族馬卡道支族阿加大社社址，明鄭時期被鄭氏屯兵所驅散，而遷往屏東林邊鄉。民國四十年由於本鄉經濟、文化、交通等均以大社為中心，故取名大社。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000170, 64000, '高雄市', '仁武區', '本地在明鄭時期實施屯田時，派駐仁武鎮於此，因而得名');
INSERT INTO "towns" VALUES (64000180, 64000, '高雄市', '鳥松區', '地名由來有二說：
1.鳥松舊稱為鳥松腳，清康熙中葉移民入墾於此地，在鳥松樹（赤榕）下建村莊，所以得稱。
2.原名為「鳥松腳庄」，因昔日，鳥松國小附近，有一棵高大茂盛的鳥松古樹，常被往返行人及商旅視為休息地點，故得名。後改為「鳥松鄉」。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000190, 64000, '高雄市', '岡山區', '清康熙年間，閩籍移民入墾於此，當時這一帶為菅茅密生之地，故初墾時稱為『竿蓁林街』。到了清乾隆年間重修府志時，記載有阿公店之名，皆認為有一老翁所開店鋪，故得稱。後來因境內有小岡山、大岡山二隆起之珊瑚礁地形，所以改稱為岡山。');
INSERT INTO "towns" VALUES (64000200, 64000, '高雄市', '橋頭區', '橋頭在清康熙年間叫做『小店仔街』。後來乾隆時期修志，其中記載：『小店子橋，俗稱橋子頭』，便以『橋子頭』取代原來『小店子街』的稱呼。');
INSERT INTO "towns" VALUES (64000210, 64000, '高雄市', '燕巢區', '今燕巢內東燕、西燕二村舊稱為『援巢中』，安招村為『援巢右』，是明鄭時期援剿中鎮與右鎮屯田舊址，故原名「援剿」。燕巢為『援剿』之諧音字。日據時期，日人因同音異義，乃改「援剿」為「燕巢」，沿用至今。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000220, 64000, '高雄市', '田寮區', '田寮一帶曾是明鄭時期援剿中鎮屯墾地域。到了清乾隆末年更有移民入墾於此，因為在墾成之田中築寮成莊，所以得稱。');
INSERT INTO "towns" VALUES (64000230, 64000, '高雄市', '阿蓮區', '清康熙末至乾隆年間，有一楊姓墾首招募大批移民分地開墾，形成阿蓮中路、岡山營等莊。其中『阿蓮』可能出自平埔族西拉雅族社名之譯音地名。另有一說：本鄉古名「阿嗹」。民國三十五年時，楊玉山先生提議本鄉為佛教聖地，而佛家認為阿蓮是彌陀佛居住的淨土，為配合地方特色，宜將地名的「嗹」字改為「蓮」，經鄉務會議通過，便正式定名。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000240, 64000, '高雄市', '路竹區', '路竹原稱為半路竹，因為以前此地居於大湖街（今湖內）與阿公店街（今岡山）之間交通必經地，地當半路上，又有茂盛的竹林，所以得稱。');
INSERT INTO "towns" VALUES (64000250, 64000, '高雄市', '湖內區', '地名由來有二說：
1.因為境內有一大湖沼，在湖岸內建莊而得名。
2.地名由來是取長治（現大湖方面）、文賢（現圍子方面）兩地區名含義而定。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000260, 64000, '高雄市', '茄萣區', '本地因為在一大潟湖外側砂嘴上，且為茄萣樹茂生之地，因而得名。');
INSERT INTO "towns" VALUES (64000270, 64000, '高雄市', '永安區', '本鄉舊稱「永安仔」，乃因鄉內原設有「新永安仔塭」及「舊永安仔塭」魚塭，寓有永保平安之意，故建鄉之時，地方士紳乃決定以「永安」為地名。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000280, 64000, '高雄市', '彌陀區', '地名由來有二說：
1.相傳明鄭時本地供奉「阿彌陀佛」，故得名
2.古稱「瀰羅港」，據中研院研究，應為平埔族語言。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000290, 64000, '高雄市', '梓官區', '地名由來有二說：
1.梓官地名之由來，似與修造船隻的官匠有關。相傳因修補軍船的官匠聚集於此而有此名。
2.明鄭成功渡台後，本地以王梓的勢力最大，而昔日凡有權勢聲望的先民，均在其名後加一「官」字，以示尊敬。故居民尊敬王梓為「梓官」，故得名。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000300, 64000, '高雄市', '旗山區', '旗山原稱蕃薯寮，因為初期移民築寮於此，並從事種植蕃薯，所以稱為『蕃薯寮』。民國九年，因其東北方有旗尾山，狀似清代蛟龍旗，所以改稱為旗山。');
INSERT INTO "towns" VALUES (64000310, 64000, '高雄市', '美濃區', '美濃舊稱為『彌濃』，其地名之由來，有一說為，美濃地方過去的先住民是曹族四社之一『美壟族』的分布之地。或有可能取自平埔族『瀰力社』與溪名『荖濃溪』，各取一字併成地名。清雍正十三年，有林姓兄弟來此開墾，籌建土地伯公廟，其開基碑文上有「瀰濃」等字樣，後定庄名為「瀰濃」，意謂該地以水為源，汲用不息之意。甲午戰後，在台日本人因懷念山明水秀的日本故鄉美濃，遂將「瀰濃」改稱為「美濃」。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000320, 64000, '高雄市', '六龜區', '地名由來有二說：
1.六龜舊稱為六龜里，六龜里源自曹族四社番芒子芒番社名之譯音。民國九年改稱為六龜。
2.因前後山巖相對，成為六個山巖，狀似龜形，故稱之。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000330, 64000, '高雄市', '甲仙區', '甲仙舊稱為甲仙埔，是阿里山四社番大武壟頭社人所建。此一帶先住民為傀儡番，甲仙埔似出自傀儡楠梓仙之埔地的縮讀，詳細地名由來有待查證。');
INSERT INTO "towns" VALUES (64000340, 64000, '高雄市', '杉林區', '杉林舊稱為山杉林，由來乃因為此地原始景觀為山杉蓊蔚成林之地而得名。');
INSERT INTO "towns" VALUES (64000350, 64000, '高雄市', '內門區', '內門舊稱為「羅漢門」，又稱「羅漢內門」。由來有二：
1.「羅漢門」原為平埔族語譯而成：羅漢門之『羅漢』是譯自馬卡道族之稱呼烏山山脈以東至楠梓仙溪一帶之地。清代在此地派兵駐守，乃為『門』之由來。羅漢門又以二仁、楠梓仙溪分水界上之大崎，分以東為羅漢外門里，以西為羅漢內門里，本鄉名由此而得。
2.因有鴻儒避居其地，故取名「羅漢門」（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000360, 64000, '高雄市', '茂林區', '地名由來有二說：
1.茂林原稱『芒子社』（蚊子社），原義不明，後來可能以樹林茂盛而借為地名。
2.原名「多納鄉」，為日語「老子」的譯音。民國四十六年，奉命改為「茂林鄉」。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000370, 64000, '高雄市', '桃源區', '本鄉原名雅你鄉（aini），布農族語為「廣大」之意。民國四十六年，奉令改為桃源鄉。寓世外桃園之雅稱。（吳國華等，國民小學社會科鄉土教材之研究－認識高雄縣，臺灣省政府教育廳 發行，國立屏東師範學院 出版）');
INSERT INTO "towns" VALUES (64000380, 64000, '高雄市', '那瑪夏區', '過去名稱：早年以當地原住民語「Mangacun」的音譯，稱此地為「蚊仔只」（Báng-á-tsí）。中華民國將此區的鄉名改稱政治意涵濃厚的「三民鄉」。 正名後的地名：那瑪夏（在當地主要族群－卡那卡那富族、布農族語分別代表「楠梓仙溪」、「愈來愈好」的意思）。');
INSERT INTO "towns" VALUES (65000010, 65000, '新北市', '板橋區', '板橋舊名「枋橋」，是台語發音，意思為「木板所做的橋」。其由來是因為在清朝乾隆年間，曾在今天板橋西方的一條小溪上，蓋了一座木橋，以利行人的來往，久而久之，此地便被命名為「枋橋」。民國九年，日本政府將「枋橋」改為「板橋」，光復後便沿用至今。');
INSERT INTO "towns" VALUES (65000020, 65000, '新北市', '三重區', '三重舊名為「三重埔」，其由來是因為淡水河與其支流間的埔地，是依照次序來命名，而此地是位於二重埔的東邊，所以稱為「三重埔」，後來再改為「三重」。「埔」是河邊沙洲的名稱，先民為了開墾土地，自然選擇近水的地區。而後由於淡水河的日漸淤積，頭前埔再也無法停靠船隻，而泥沙沖積所成的沙洲也日漸擴大，登陸的地點遂再向後退縮，於是把這後來開發的土地稱為二重埔（台語發音）。同樣的，漢族先民開發的足跡來到了現今的三重市，為有別於頭前與二重，遂定名為三重埔。（詹亦哲，民82，這裡是我生長的地方---台北縣，台北縣國民教育輔導團編）');
INSERT INTO "towns" VALUES (65000030, 65000, '新北市', '中和區', '「中和」地名的由來有兩種說法，一種說法是指，此地的原來名稱「漳和」的台語音與「中和」近似，所以命名此地為「中和」；另一種說法是指，「中和」這個地名是從此地境內的「中坑」、「漳和」兩個聚落名稱中各取一個字而成的。');
INSERT INTO "towns" VALUES (65000040, 65000, '新北市', '永和區', '永和市在日據時期時分設六保。民國三十六年時，隸屬海山區中和鄉。民國四十二年，分為頂溪、上溪、網溪三村。民國四十七年，分鄉設鎮從中和鎮劃出，正式立名為永和鎮。此名為地方耆宿楊仲佐先生所取，他認為不管是本地的泉州人、中和的彰州人，或是後來遷入的各省籍人士，都應體認和諧、團結的重要，才能有繁榮的建設，「永久的和平」。於是此地便稱為永和。民國68年升格為縣轄市。（永和市誌，民75）');
INSERT INTO "towns" VALUES (65000050, 65000, '新北市', '新莊區', '新莊在清朝康熙年間，就有漢人來此開墾，後來在雍正年間，由於人們在此設立新的聚落，便將此地命名為「新莊」。另一說是由『新的武勞灣莊』簡化而來。');
INSERT INTO "towns" VALUES (65000060, 65000, '新北市', '新店區', '「新店」地名的由來有兩種說法，一種是說當時人們在今天的碧潭東岸興建店鋪，後來發展成為街市，由於附近以前並無店鋪，所以就稱此地為「新店」；另一種說法是指，本地原先已有店鋪，後來在道光年間，因為受到山洪爆發的沖毀，又重新興建店鋪，而將此地命名為「新店」。');
INSERT INTO "towns" VALUES (65000070, 65000, '新北市', '樹林區', '樹林這一帶以前是大漢溪氾濫的沼澤地，由於樹林叢生，所以命名為「樹林」。另有一種說法是，在乾隆年間，來此開墾的漢人為了保護水圳的堤岸，種了許多林木在堤岸上，後來便稱此地為「樹林」。');
INSERT INTO "towns" VALUES (65000080, 65000, '新北市', '鶯歌區', '「鶯歌」地名的由來是因為此地的山上有一塊突出的岩石，其形狀類似鷹哥，所以此地命名為「鷹哥」。本鎮在清朝光緒年間名為鶯歌石庄。民國九年，日據時期改為鶯歌庄，民國二十九年，升格為鶯歌街，至民國三十四年台灣光復改稱為鶯歌鎮。（陳碧松，民68，鶯歌鎮誌）');
INSERT INTO "towns" VALUES (65000090, 65000, '新北市', '三峽區', '三峽舊稱「三角湧」，三角湧庄之名始見於嘉慶八年（1803），形成街肆後以土名『三角湧街』相稱。「湧」的台語意思是「水起浪」的意思。因為三峽位於大漢溪匯納橫溪、三峽溪的地方，是一塊三角形平原，上述三條河流在此匯集，溪流激盪，所以稱為「三角湧」。民國九年時，改為三峽而沿用至今。（三峽鎮志，民82，三峽鎮公所  發行）');
INSERT INTO "towns" VALUES (65000100, 65000, '新北市', '淡水區', '淡水舊稱為「滬尾」，「滬」是指以前設在河口或是近海之處，由許多石頭堆成，利用海水的漲退潮來捕魚的一種設施，而在設有「滬」的尾處，就是「滬尾」。另有一說：在閩南語中，滬和雨諧音，指此地多雨，過了這裡雨就停了，故稱「滬尾」。民國九年時，改用此地所濱臨的淡水河河名，為此地的地名。');
INSERT INTO "towns" VALUES (65000110, 65000, '新北市', '汐止區', '汐止舊稱為「水返腳」，是指此地在滿潮時，海水會溯淡水河進入基隆河，至此而返的意思，民國九年時，才改為「汐止」。');
INSERT INTO "towns" VALUES (65000120, 65000, '新北市', '瑞芳區', '清光緒年間，陸路交通不便，往來於台北地區全靠基隆河水路運送補給，瑞芳對外之水運接駁渡口柑仔瀨，即今柑坪里（俗稱內瑞芳）成為台北地區往返於噶瑪蘭（今之宜蘭）間者必經之地。後因金瓜石、九份山區陸續發現金礦，採金人絡繹不絕，上山採金必先經由柑坪里，此時基隆河接駁渡口附近，有一賴姓商家鋪號「瑞芳」，店貨、日用品、南北雜貨俱備，成為前往山區採金與往返噶瑪蘭中途補給休息處所。久之，往來者眾，均不約而同或口頭相約，不呼地名，而呼「去瑞芳」，或「由瑞芳回來」，聚集同行，沿襲成名。（瑞芳鎮簡介，民83）');
INSERT INTO "towns" VALUES (65000130, 65000, '新北市', '土城區', '本市昔日為山胞擺接社漁獵之區，清朝初年時，便有先民來此開墾，因為在此設土牆防禦番人的侵害，所以就稱此地為「土城」。（土城市志，民83，土城市公所 發行）');
INSERT INTO "towns" VALUES (65000140, 65000, '新北市', '蘆洲區', '「蘆洲」舊稱河上洲、和尚洲或鷺洲。因此地係由大嵙崁溪沖積而成之沙洲，故初名河上洲。後因清乾隆年間，竹塹（即今新竹）城隍廟僧侶梅福，向官府稟請以現今水湳村一帶產業為關渡媽祖廟之業產獲准，每年來此徵收租穀，於是鄉里百姓稱為和尚厝。因和尚與河上音相近，彼此混合，遂以和尚洲為名。又因為本鄉原為一沙洲，凡洲渚有水處，蘆草叢生，蘆花盛開時節更因白鷺棲息其間，蔚為景觀，故又稱鷺洲。現今「蘆洲」之由來，乃因當時蘆葦叢生，才改稱為「蘆洲」。（蘆洲鄉志，民82，蘆洲鄉公所 編印）');
INSERT INTO "towns" VALUES (65000150, 65000, '新北市', '五股區', '本鄉早期因為有五個人出資合股來此地拓墾，所以稱此地為「五股」。');
INSERT INTO "towns" VALUES (65000160, 65000, '新北市', '泰山區', '此地以「泰山」為地名，似乎是取自於中國大陸的名山﹍泰山。');
INSERT INTO "towns" VALUES (65000170, 65000, '新北市', '林口區', '林口舊稱為「樹林口」，是指此地位於森林地帶入口之處，後來則改為「林口」。');
INSERT INTO "towns" VALUES (65000180, 65000, '新北市', '深坑區', '「坑」是山谷的意思，而此地位於景美溪山谷之中，所以稱此地為「深坑」。（安倍明義）');
INSERT INTO "towns" VALUES (65000190, 65000, '新北市', '石碇區', '本鄉昔日溪水深且急，小船可溯溪而上,但是停泊時必須繫石以碇泊，故稱石碇。另一說是:本地溪中到處石塊，碇置於溪谷，並為早期居民過河的墊腳石，有如舊式房屋大門的石質門檻(閩南語稱戶碇)，因而得名。');
INSERT INTO "towns" VALUES (65000200, 65000, '新北市', '坪林區', '因為此地區的地形多平坦的河階面，岸旁以前為樹林茂盛之地，所以稱為「坪林」。');
INSERT INTO "towns" VALUES (65000210, 65000, '新北市', '三芝區', '本鄉最早為小雞籠社，漢人入居後稱為小雞（圭）籠莊，清末光緒年間稱「芝蘭三堡」，民國九年時，取原來「芝蘭三堡」中的「三」和「芝」兩字為地名「三芝」，以後就沿用至今。（三芝鄉志，民83）');
INSERT INTO "towns" VALUES (65000220, 65000, '新北市', '石門區', '因為此地境內有一海蝕洞，形狀近似石門，所以稱此地為「石門」。');
INSERT INTO "towns" VALUES (65000230, 65000, '新北市', '八里區', '八里舊稱為「八里坌」，是由於此地原為凱達格蘭族之八里坌社的居住地，後來改名為「八里」。');
INSERT INTO "towns" VALUES (65000240, 65000, '新北市', '平溪區', '基隆河上游溪谷狹窄，多瀑布和急流，但是當基隆河流抵本地時，溪水趨向平緩，因此就稱此地為「平溪」。');
INSERT INTO "towns" VALUES (65000250, 65000, '新北市', '雙溪區', '因為此地有牡丹溪及平林溪兩溪在此會流，所以就稱為「雙溪」。');
INSERT INTO "towns" VALUES (65000260, 65000, '新北市', '貢寮區', '地名由來有二說：一說是此地名出自於平埔族語「陷阱」的譯音，因為以前此地山豬特別多，初期的移民在此設陷阱來捕獵山豬，故有「貢寮」地名的出現。另一說為:早期本鄉墾民為根絕毒蛇猛獸，乃以草寮將洞穴偽裝，並以樹木摃之，作為誘捕野獸的陷阱，先民稱此種草寮為貢仔寮，久而久之即成為本鄉地名。');
INSERT INTO "towns" VALUES (65000270, 65000, '新北市', '金山區', '金山舊稱為「金包里」，是此地凱達格蘭族之「金包里」社的社名，在民國九年時，一直沿用至今。傳說中有本省北部原住民「平埔番」二十多人，因捕魚遭遇颱風，漂至本鄉海岸，見荒蕪而離去，遂沿海尋至貢寮鄉安住，爾後數百年，經由其子孫形成三紹四社、大雞籠社、金包里社等。其中金包里社沿北部海岸漸向淡水分佈。「金包里」之名稱，是依照番語口音基巴里翻譯漢字而來。日據台灣時，本地稱為金包里堡。民國九年，有鑒於此地背大屯山，乃去其「包」字，加上「山」字，成為「金山」，光復後，依照原金山莊區域改設金山鄉。（李鴻謀，民82，金包里誌）');
INSERT INTO "towns" VALUES (65000280, 65000, '新北市', '萬里區', '萬里」地名的由來，可能是出自於在十七世紀時，西班牙人所稱基隆港附近的漢人聚落為『parian』的譯音而來。因其與閩南語之『萬里』音相近。又早期原住民稱此漢人居住的聚落為『vasai』，漢人以近音譯字『瑪鋉』稱之。故本鄉又有『瑪鋉』之名。');
INSERT INTO "towns" VALUES (65000290, 65000, '新北市', '烏來區', '「烏來」是泰雅語，意思是溫泉。據傳以前有一群泰雅族人來此地附近時，遠望溪水中煙霧濛濛而升，經觀察後，發現這些煙霧是由岸邊湧出的熱水所形成的，於是就高呼「Urai」，亦即溫泉的意思，此後便稱此地為「烏來」。');
INSERT INTO "towns" VALUES (66000010, 66000, '臺中市', '中區', '清代台灣（鹽務總管）所在地，舊稱（鹽館）');
INSERT INTO "towns" VALUES (66000020, 66000, '臺中市', '東區', '台灣府城（南門）遺址，今位居大台中市（東）側故稱東區');
INSERT INTO "towns" VALUES (66000030, 66000, '臺中市', '南區', '有平埔族老婦人不願搬走，仍居住在此地，漢人稱之為（番婆）庄');
INSERT INTO "towns" VALUES (66000040, 66000, '臺中市', '西區', '有大地主在此設立繳田租的公共事務館，舊稱（公館）');
INSERT INTO "towns" VALUES (66000050, 66000, '臺中市', '北區', '早期漢人（邱厝）（賴厝）形成姓氏聚落，由於賴姓居多，故稱（賴厝廓）。');
INSERT INTO "towns" VALUES (66000060, 66000, '臺中市', '西屯區', '昔日平埔族祭祖所在地，有一湖潭叫（馬龍潭）');
INSERT INTO "towns" VALUES (66000070, 66000, '臺中市', '南屯區', '拓荒時期打造墾耕用具牛（犁）鋤（頭）的（店）舖區，故稱（犁頭店），日據時期改稱南屯。');
INSERT INTO "towns" VALUES (66000080, 66000, '臺中市', '北屯區', '原叫（三十張犁），因為台灣的漢人計算田地，以每一張犁為計算標準，一個人在播種期間最多約可犁耕五甲地，因本區當年開墾了一百五十甲田地，一張犁為五甲地，因本區當年開墾了一百五十甲田地，一張犁為五甲地，所以舊稱（三十張犁），日據時期改稱（北屯）');
INSERT INTO "towns" VALUES (66000090, 66000, '臺中市', '豐原區', '豐原舊稱為『葫蘆墩』，本地原屬於平埔族拍宰海族岸裏社的居住地，『葫蘆墩』是他們對本地之稱呼的譯音。清末年間，劉巡撫以其地物產豐饒而稱為富春鄉，亦稱為小蘇州。民國九年（大正九年）由於本地所產之米質極佳，是本地的特產，就將原地名改為『豐原』。至於「葫蘆墩」的由來，說法有二：本區早期為平埔族部落，族人叫「泰雅爾洞」，其音與葫蘆墩頗相似，傳為其轉音而來。豐原市境內有屯腳、屯頭、屯身三小丘，形似葫蘆而得名。（臺中縣鄉土史料--耆老口述歷史，民83，臺灣省文獻委員會 編印）');
INSERT INTO "towns" VALUES (66000100, 66000, '臺中市', '東勢區', '東勢最早叫「板寮」，意思是木工做木板的工寮。後改為「東勢角」則有二說：
1.是因為對當時的豐原人來說，「板寮」只不過是在豐原東方偏僻地區的一個部落，所以就叫做「東勢角」，是指東方的角落。日人剛到臺灣時亦取用「東勢角」的地名，之後才把「角」去掉，改為「東勢」而沿用至今。
2.是由於本地的地勢向東方伸張，因此自古就有此稱。後來才改稱為『東勢』。（臺中縣鄉土史料--耆老口述歷史，民83，臺灣省文獻委員會 編印）');
INSERT INTO "towns" VALUES (66000110, 66000, '臺中市', '大甲區', '本地以前是道卡斯族各社的居住地。大甲之地名即自道卡斯平埔族之族稱Taokas譯過來的。閩南語「大」之讀音Tai或Ta；「甲」為Kah併為Ta-kah，與Taokas近音。（臺中縣地名沿革專輯第一輯，民82，臺中縣立文化中心 印行）');
INSERT INTO "towns" VALUES (66000120, 66000, '臺中市', '清水區', '清水舊稱為『牛罵頭』，這是譯自本地的平埔族拍瀑拉族的『牛罵頭』社，民國九年時，鑒於該地有良質泉水『埤仔口泉』之湧出，乃更名為『清水』，光復後沿襲至今。');
INSERT INTO "towns" VALUES (66000130, 66000, '臺中市', '沙鹿區', '本地以前是拍瀑拉族『沙鹿』社的居住地，故有此稱。「沙轆」係本鎮舊稱，原為平埔族一支之拍瀑拉（Papora）沙轆社（Salach）活動範圍，清代稱迴馬社或遷善社。民國九年改稱沙鹿，沿用至今。（沙鹿鎮志，民83，沙鹿鎮公所 編印）');
INSERT INTO "towns" VALUES (66000140, 66000, '臺中市', '梧棲區', '梧棲之地名是由「五汊」演變而來的。據道光中葉（1832）周璽撰彰化縣志山川圖作『五汊港』；同治年間（1862-1874）纂成的臺灣府輿圖纂要仍作『五汊港』；至光緒年間修成的臺灣地輿全圖則作『梧栖港』，可窺知清道光年間是通稱『五汊』而不作『梧棲』。因梧棲地當牛罵頭溪口小型三角洲上，五個扇狀分流水汊處，故得稱。後由『五汊』諧音雅化而得之後的『梧汊』、『梧棲』、『鰲西』。『鰲西』地名由來的另一說法：因梧棲鎮位於大甲、大肚兩溪之間，兩水會合鰲山（即今清水牛罵頭山），所以昔日地名為「鰲西」（即鰲峰山之西端）。（臺中縣地名沿革專輯第一輯，民82，臺中縣立文化中心 印行）（臺中縣鄉土史料--耆老口述歷史，民83，臺灣省文獻委員會 編印）');
INSERT INTO "towns" VALUES (66000150, 66000, '臺中市', '后里區', '本鄉舊稱內埔鄉，早期發生聚落處稱「屯子腳」，分屯頂、屯下。後因避免與屏東縣內埔鄉同名而改稱后里鄉。乃因為本地的聚落是創建於平埔族麻薯社之背後，故稱『后里』。（臺中縣鄉土史料--耆老口述歷史，民83，臺灣省文獻委員會 編印）');
INSERT INTO "towns" VALUES (66000160, 66000, '臺中市', '神岡區', '因為本地最初的移民大多來自廣東省嘉應州鎮平縣的『神岡社』，故稱此地為『神岡』。');
INSERT INTO "towns" VALUES (66000170, 66000, '臺中市', '潭子區', '潭子』舊稱為『潭仔墘』，因為創建聚落於柳川上游凹岸侵蝕坡的深水岸邊，故有此稱，後來才改為『潭子』。');
INSERT INTO "towns" VALUES (66000180, 66000, '臺中市', '大雅區', '大雅昔稱為『壩雅』或『埧雅』，這是因為本地是河壩草埔之一部份，客家語稱為『壩仔』，與台語之『埔仔』同義，民國九年才改為『大雅』。');
INSERT INTO "towns" VALUES (66000190, 66000, '臺中市', '新社區', '本地以前稱為『新社仔』，是平埔族巴宰海族之樸仔籬社的分佈地，『新社』之由來，可能是曾經有平埔族人在此創建新的聚落而有此稱。');
INSERT INTO "towns" VALUES (66000200, 66000, '臺中市', '石岡區', '本地以前稱為『石崗仔』，石崗是石山丘的意思，因為大甲溪在此納入新社溪，其坑口形狀如甕缸，裡面滿佈粗石，故有此稱。後來才改稱為『石岡』。');
INSERT INTO "towns" VALUES (66000210, 66000, '臺中市', '外埔區', '在日據時期，今天的后里鄉統稱為內埔，而在其西邊之本鄉則括稱為外埔，『外埔』就成為本鄉之地名。');
INSERT INTO "towns" VALUES (66000220, 66000, '臺中市', '大安區', '本鄉因大安港而得名。大安港的舊名，在明末稱之為「海翁窟港」，（海翁即為鯨魚），清朝時稱為「螺絲港」、「勞絲港」等，是因螺殼上之迴旋紋，譬喻船隻之出入航道繞轉之狀。至於有大安港之稱是因為本港可以讓船隻安全的停泊而得名。（大安鄉志，民78，大安鄉公所 編印）');
INSERT INTO "towns" VALUES (66000230, 66000, '臺中市', '烏日區', '烏日以前稱為『湖日』或是『凹入』，這是因為本地的地勢較低，境內為貓羅溪、烏溪、草湖溪、旱溪等溪匯入大肚溪的地方，地勢呈現凹入的情勢，故有此稱，後來改稱為烏日。');
INSERT INTO "towns" VALUES (66000240, 66000, '臺中市', '大肚區', '本地以前是拍瀑拉族大肚社的所在地，故命名為『大肚』。');
INSERT INTO "towns" VALUES (66000250, 66000, '臺中市', '龍井區', '龍井以前稱為『茄投』，可能是平埔族社之譯音地名，後來則改稱為『龍井』，這是取自於今龍泉村之舊地名『龍目井』，因為當地沙田路之清水祖師廟『龍泉岩宮』前有一古井而命名的，後來則改稱為『龍井』。');
INSERT INTO "towns" VALUES (66000260, 66000, '臺中市', '霧峰區', '霧峰舊稱為『阿罩霧』，其由來有兩種說法：一種說法是因為本地聚落建在鳳山山麓，晨間經常濃霧籠罩，故有此稱；第二種說法是認為『阿罩霧』是本地土著族地名之譯音，按台灣地名中，凡冠以『阿』字者，多屬番社之譯音，例如阿束、阿冷等。民國九年時，改稱為『霧峰』。');
INSERT INTO "towns" VALUES (66000270, 66000, '臺中市', '太平區', '太平昔稱『鳥松頭』，因為建莊地入山口福德祠旁有一棵大的鳥松樹（榕樹之一種），故有此稱。
「太平」地名的由來有二說：
1.本地原屬於洪雅族的居住範圍，在清乾隆年間，就有漢人來此開墾，開墾初期，與洪雅族常發生衝突，漢人受害嚴重，所以在剛建立村莊時，就冀以太平之願望，故命名為『太平』，後來就將此地改稱為『太平』。
2.日據初期日軍推進到東興堡，準備進攻鳥松頭時，有一位當地人名叫「何錦成」，在半路迎接帶路，而太平當地人都很善良，要反抗的民眾也都逃走了。日軍指揮官說：「此地真是大平」，日據後便命名為「大平」，光復後才改成「太平」。（臺中縣鄉土史料--耆老口述歷史，民83，臺灣省文獻委員會 編印）');
INSERT INTO "towns" VALUES (66000280, 66000, '臺中市', '大里區', '大里』舊稱為『大里杙』，係出自當地平埔族洪雅族之社名的譯音，民國九年才改稱為『大里』。');
INSERT INTO "towns" VALUES (66000290, 66000, '臺中市', '和平區', '本鄉在日據時期是泰雅族的分佈地，並沒有庄名，光復改稱為和平鄉，乃是以四維八德中之『和平』為鄉名。');
INSERT INTO "towns" VALUES (67000010, 67000, '臺南市', '新營區', '地名由來於明鄭時期在此設鎮屯田。初期因有屯辦何積善等人在鹽水鎮之舊營里屯墾稱為『舊營』，故與之對稱為『新營』。');
INSERT INTO "towns" VALUES (67000020, 67000, '臺南市', '鹽水區', '地名以前叫做鹽水港，在明鄭時期稱為奎庄。在清雍正九年闢為島內貿易港。潮滿海水可及，故與稍北的淡水港對稱為鹽水港。因為以前港道環繞街區，形成彎曲狀，有如半月，所以鹽水港又稱為『月津港』或月港。');
INSERT INTO "towns" VALUES (67000030, 67000, '臺南市', '白河區', '白河街區舊稱為店仔口街，因為白水溪穿流於石灰岩山區，水色白濁，所以改稱為白河街。白河舊名「店仔口」，由來是在清乾隆年間，白河是往當時已非常繁榮的商業中心『下茄苳』的必經之路，因此有一吳姓的異鄉人於現在市場的十字路口結廬賣涼水茶點，提供行人休憩場所。店仔口指的就是草廬的門口。後來改稱「白河」的理由是地方人士以「店仔口」不雅，而境內有白水溪從東繞南而西，環村而流，乃以「白河」為名。光復後改為「白河鎮」。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000040, 67000, '臺南市', '柳營區', '地名由來有二說：
1.柳營舊稱為查畝營（台語），即明鄭時期女宿鎮的屯田之地。今柳營之名，應起自明鄭陸軍鎮名柳宿鎮，柳宿鎮可能與女宿鎮毗鄰而屯，故名。
2.柳營昔稱「查畝營」，即勘查田畝之營部。「查畝營」的地名沿用至民國九年（日據大正九年）。後因本地居民以劉姓居多，劉、柳同音，乃改名為「柳營庄」，光復後改設「柳營鄉」。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000050, 67000, '臺南市', '後壁區', '後壁舊名為後壁寮，意思就是在後方的寮舍。');
INSERT INTO "towns" VALUES (67000060, 67000, '臺南市', '東山區', '東山從前是平埔族洪雅族哆囉嘓社所在地，後來漢人漸增，開墾於此，形成哆囉嘓庄。後來改稱番社街，光復後又鑑於其名不雅，因其在新營東方之山區，所以改稱為東山。');
INSERT INTO "towns" VALUES (67000070, 67000, '臺南市', '麻豆區', '此地以前是平埔族西拉雅族麻豆社址，是台南市附近四大平埔族社之一。');
INSERT INTO "towns" VALUES (67000080, 67000, '臺南市', '下營區', '下營地方是明鄭時期設鎮屯田之地的舊名，依據屯營之相關位置，所以有頂、中、下之別。');
INSERT INTO "towns" VALUES (67000090, 67000, '臺南市', '六甲區', '地名之由來，相傳為鄭成功參軍陳永華駐軍在此開墾荒地，最初依據開墾面積取名有二甲、六甲、七甲等村。六甲位居中心，故取名為「六甲鄉」。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000100, 67000, '臺南市', '官田區', '官田舊稱為官佃，是荷據時期王田之所在地，到了明鄭時期改為官田，招募移民來墾，耕者為官佃，民國九年改為今稱，沿用至今。');
INSERT INTO "towns" VALUES (67000110, 67000, '臺南市', '大內區', '鄉名取自大內村的舊稱大內，以前移民先建北方一小庄稱頂庄，東南方為內庄，因為此地在內方庄，所以得名。三百餘年前，楊氏兩兄弟由漳州府龍溪縣遷來。長兄名楊內，住在「內庄」。弟弟名楊石，住於「石仔瀨」，總稱為「內庄」。光復後改為大內鄉。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000120, 67000, '臺南市', '佳里區', '佳里原為平埔族西拉雅族蕭壟社之社域，民國九年取境內地名佳里興之佳里，改舊稱蕭壟庄為佳里街，光復後沿襲為鄉名。');
INSERT INTO "towns" VALUES (67000130, 67000, '臺南市', '學甲區', '學甲即平埔族西拉雅族番社之譯音地名，有一說為學甲即史椰甲社。');
INSERT INTO "towns" VALUES (67000140, 67000, '臺南市', '西港區', '地名由來有二說：
1.此地東方約三公里處，有直加弄港（今安定），因相對位置關係，本地乃取名「西港仔」
2.此地昔日大部均屬海埔，西港是濱臨汊港，因位於後營之西，故稱之。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000150, 67000, '臺南市', '七股區', '地名由來有二說：
1.七股原稱為七股寮，清道光年間有十六股首招佃開墾此地。七股寮即當時由七股首招來的佃戶所築茅寮的地方，後來發展為村莊。
2.據傳此地形成海埔新生地後，有從福建省來台的七名移民，他們連袂前來共同墾殖一魚場，名曰「七股塭」，此後就一直沿稱「七股」。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000160, 67000, '臺南市', '將軍區', '清康熙二十二年，施琅將軍平台有功，清廷將本鄉內的荒埔地，賜予施琅為世襲之業地，所以得稱。');
INSERT INTO "towns" VALUES (67000170, 67000, '臺南市', '北門區', '北門舊名北門嶼，此地以前是倒風港大潟湖內一濱外沙洲，因其在北方倒風港門戶處之沙洲，所以得名。另有二說為：1.它位居臺灣府北方而得名。2.它與青峰闕北方出入口有關。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000180, 67000, '臺南市', '新化區', '新化舊名大目降，是西拉雅平埔族（SIRAYA）的古地名，為平埔族大目降社聚居之地。明永曆十五年（西元一六六二年），鄭成功討平大目降社，且將本地規劃為承天府所管轄之新化里，其含意就是取「新歸化之番社」。清朝時設大目降庄，後來漢人移入，日趨繁榮，就改名稱為「大穆降街」。日本統治台灣時，改名為「大目降街」。民國九年，地方制度修改，大目降街改為新化街，是新化郡行政所在地。光復後正式定名為新化鎮。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000190, 67000, '臺南市', '善化區', '由於明鄭時期，本地是屬於『善化里西堡』，民國九年時，將舊稱『灣裡』改為『善化』。『灣裡』是從本地西拉雅族目加溜灣社沿用而來的。');
INSERT INTO "towns" VALUES (67000200, 67000, '臺南市', '新市區', '地名由來有二說：
1.相傳十七世紀荷蘭人佔據台南安平時，將原居住於該地之西拉雅族人，遷移創建之新社址。
2.相傳三百年前，山內方面的居民，運搬產物往台南府販賣，常在此地樹下休息，苦於無處購買食物果腹，乃鼓勵新港住民（即新和村、社內村）到此地零售食物，以便利往來商客，而後漸漸聚集成一條小街市頭，因此稱之為「新市」。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000210, 67000, '臺南市', '安定區', '本地原稱為『直加弄』，這是譯自當地西拉雅族目加溜灣社之屬社的社名。民國九年時，依據本地在清代時，屬於『安定東里』，便改稱為『安定』。');
INSERT INTO "towns" VALUES (67000220, 67000, '臺南市', '山上區', '山上舊稱為『山子頂』，係因本鄉屬於丘陵地形，境內分佈著許多的小山丘，聚落多建立在小山丘上，故稱為『山仔頂』，後來則改稱為同義的『山上』。');
INSERT INTO "towns" VALUES (67000230, 67000, '臺南市', '玉井區', '玉井在荷蘭占領及清代稱「大武瓏」，是曹族四社熟番－醮吧年社、芒子芒社、宵里社及今楠西鄉的茄拔社等原住民所住。民國九年才以「醮吧年」Tapani的日語近似音「玉井」（日語Tamai）來稱呼本鄉，而沿用至現在。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000240, 67000, '臺南市', '楠西區', '本地舊稱為『茄拔』，這是出自阿里山四社群中『茄拔』社之社名，後來則改稱為『楠西』，這是因為本地在清代時是屬於『楠梓仙溪西里』，後來便將其簡寫成『楠西』，而成為本地之地名。');
INSERT INTO "towns" VALUES (67000250, 67000, '臺南市', '南化區', '本地舊稱為『南庄』，民國九年時，乃取南庄之『南』與其所隸屬『內新化南里』之『化』，拼成『南化』。而『南庄』則是相對於對岸的北寮，位於北寮南方之村落，即稱為『南庄』。');
INSERT INTO "towns" VALUES (67000260, 67000, '臺南市', '左鎮區', '『左鎮』地名之由來，是因為明鄭時期，設侍衙駐兵於轄內之左隅，故稱「左鎮」。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000270, 67000, '臺南市', '仁德區', '仁德舊稱為『土庫』，係指以竹子編成並塗上泥土的庫倉，這種庫倉是用來儲藏穀子的，由於本地有許多土庫，故有此稱。民國九年時，改以明鄭時期本地所設之『仁德里』為名而改為『仁德』。');
INSERT INTO "towns" VALUES (67000280, 67000, '臺南市', '歸仁區', '本地舊稱紅瓦厝，乃是鄉民多以紅瓦覆屋頂而得名。明鄭時期，因鄭氏勸導歸化，並設歸仁里。光復後改為「歸仁鄉」。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000290, 67000, '臺南市', '關廟區', '此地原名「香洋」，因種植香洋得名。後因境內關廟村20號之山西堂，奉祀關聖帝君，故命名為「關廟」（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000300, 67000, '臺南市', '龍崎區', '本鄉名稱由來是在民國九年時，從鄉內的龍船（龍船村）及崎頂（崎頂村）兩地名中，各取一字併成庄名，光復後沿用至今。');
INSERT INTO "towns" VALUES (67000310, 67000, '臺南市', '永康區', '永康舊稱為埔姜頭，因為以前此地未開墾時，為埔姜樹蔓生之荒埔，所以得名。明鄭成功時為部將林、黃等員駐屯之地，稱「永康里」。日據時地名大改革，乃以明鄭時期本地隸屬「永康里」，改稱「永康庄」。光復後改庄為鄉，民國八十一年改制為永康市。（臺南縣鄉土教材，民84，臺南縣政府 出版）');
INSERT INTO "towns" VALUES (67000320, 67000, '臺南市', '東區', '本區位於本市的東南方，在日治時期，本區純位於本市的東部，故命名為東區，後來於民國35年將安順庄（今安南區）併入本市後，使本區位置趨於東南，但仍命名為東區。');
INSERT INTO "towns" VALUES (67000330, 67000, '臺南市', '南區', '本區因位於本市的南端，故命名為南區。');
INSERT INTO "towns" VALUES (67000340, 67000, '臺南市', '北區', '本區位於台南府城的北邊，古廟甚多，極具歷史風味。');
INSERT INTO "towns" VALUES (67000350, 67000, '臺南市', '安南區', '本區原屬於台南縣之安順鄉，民國35年奉令劃歸台南市管轄，為紀念從台南縣安順鄉劃分歸入台南市，乃取安順鄉之「安」字及台南市之「南」字，合併命名本區為「安南區」。');
INSERT INTO "towns" VALUES (67000360, 67000, '臺南市', '安平區', '安平」一名之由來有兩種說法，一種說法是指鄭成功在登陸此地打敗荷蘭人之後，懷念其泉州府晉江縣安平鎮的故居，乃將此地的原名「一鯤身」改名為「安平」（花松村，1996）。另一種說法是指本地往昔為台灣南方的第一良港，船舶出入甚為平穩安定，故稱「安平」（安倍明義，1996）。');
INSERT INTO "towns" VALUES (67000370, 67000, '臺南市', '中西區', '本區位於本市之中央，故命名為中區。本區因位於本市的西邊，故命名為西區。');
INSERT INTO "towns" VALUES (68000010, 68000, '桃園市', '桃園區', '在清朝時，此地就有漢人入墾，當時在此地遍植桃樹，所以就稱此地為『桃園』。');
INSERT INTO "towns" VALUES (68000020, 68000, '桃園市', '中壢區', '本地以前正位於竹塹與八里坌中間，是旅客、商人往來必經的中途站，再加上此地多地塹地形，客家語稱此地塹地形為『壢』，所以稱此地為『中壢』。');
INSERT INTO "towns" VALUES (68000030, 68000, '桃園市', '大溪區', '大溪位於淡水河的幹流大漢溪旁，舊稱為『大嵙崁』，是來自於當地的凱達格蘭族霄裡社人稱大漢溪的譯音，後來才改稱為『大溪』。');
INSERT INTO "towns" VALUES (68000040, 68000, '桃園市', '楊梅區', '在清乾隆年間，此地即有漢人來此拓墾，當時墾民在此地遍植楊梅樹，故稱此地為『楊梅』。');
INSERT INTO "towns" VALUES (68000050, 68000, '桃園市', '蘆竹區', '本鄉在開墾初期，是一塊蘆竹茂生之地，移民在此地居住形成聚落，就稱此地為『蘆竹』。');
INSERT INTO "towns" VALUES (68000060, 68000, '桃園市', '大園區', '此地舊稱『大坵園』，意思是指大塊的旱田，因為以前此地缺乏水利，只能種植甘藷及一些耐旱的蔬菜，所以就稱為『大坵園』，後來才簡稱『大園』。');
INSERT INTO "towns" VALUES (68000070, 68000, '桃園市', '龜山區', '本鄉地名的由來是取自於以前境內的平埔族社名『龜崙社』，後來將『崙』改為『山』而形成今天的『龜山』。');
INSERT INTO "towns" VALUES (68000080, 68000, '桃園市', '八德區', '八德舊名為『八塊厝』，是指以前此地初建聚落時，只有八戶人家居住。台灣光復後，最初稱為八塊鄉，後來改稱八德鄉。');
INSERT INTO "towns" VALUES (68000090, 68000, '桃園市', '龍潭區', '此地名的由來是因境內有一大陂潭『龍潭陂』，故有此稱。');
INSERT INTO "towns" VALUES (68000100, 68000, '桃園市', '平鎮區', '此地舊稱為『安平鎮』，是因為以前為了保護從大湖口至中壢、桃園之行旅的安全，曾在此地設置了張望寮，所以原稱此地為『張望寮』，後來取以保護平安的意思，改稱為『平安鎮』。民國九年時，則簡稱為『平鎮』。');
INSERT INTO "towns" VALUES (68000110, 68000, '桃園市', '新屋區', '清乾隆年間，此地西邊附近，就有漢人來此開墾，由於常遭平埔族人的襲擊獵首，乃棄原來住屋向東移，另築新屋以居，『新屋』便成為此地的地名。');
INSERT INTO "towns" VALUES (68000120, 68000, '桃園市', '觀音區', '此地舊名為『石觀音』，是因為當地有位民眾在今天的觀音溪溪流中，發現一塊酷似佛像的天然石頭，大家都認為是觀音菩薩像，於是建廟來供奉，頗為靈驗。民國九年時，即依此取名為『觀音』。');
INSERT INTO "towns" VALUES (68000130, 68000, '桃園市', '復興區', '此地舊稱為『角板鄉』，是因為境內有角板山的緣故，而『角板山』名稱的由來，是因為以前劉銘傳至此開山撫番時，見此地山峰突起如角，而河階面平坦如板，所以就命此地為『角板山』。後來改稱此地為『復興』，則是有冀以民族復興的意思。');

